OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*-------------------------------------------------------------------------
 *   EFM8BB1.h - Register Declarations for the SiLabs EFM8BB1 Processor
 *   Range
 *
 *   Copyright (C) 2015, Kharitonov Dmitriy, kharpost@altlinux.org
 *
 *   This library is free software; you can redistribute it and/or modify it
 *   under the terms of the GNU General Public License as published by the
 *   Free Software Foundation; either version 2, or (at your option) any
 *   later version.
 *
 *   This library is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 *   GNU General Public License for more details.
 *
 *   You should have received a copy of the GNU General Public License
 *   along with this library; see the file COPYING. If not, write to the
 *   Free Software Foundation, 51 Franklin Street, Fifth Floor, Boston,
 *   MA 02110-1301, USA.
 *
 *   As a special exception, if you link this library with other files,
 *   some of which are compiled with SDCC, to produce an executable,
 *   this library does not by itself cause the resulting executable to
 *   be covered by the GNU General Public License. This exception does
 *   not however invalidate any other reasons why the executable file
 *   might be covered by the GNU General Public License.
 * -------------------------------------------------------------------------*/
#ifndef EFM8BB1_H
#define EFM8BB1_H

/* Supported Devices:
  EFM8BB10F2G
  EFM8BB10F4G
  EFM8BB10F8G
*/

#include <compiler.h>

/*  BYTE Registers  */

SFR(       P0, 0x80 ); /* PORT 0 */
SFR(       SP, 0x81 ); /* STACK POINTER */
SFR(      DPL, 0x82 ); /* DATA POINTER - LOW BYTE */
SFR(      DPH, 0x83 ); /* DATA POINTER - HIGH BYTE */
SFR(    PCON0, 0x87 ); /* POWER CONTROL */
SFR(     TCON, 0x88 ); /* TIMER CONTROL */
SFR(     TMOD, 0x89 ); /* TIMER MODE */
SFR(      TL0, 0x8A ); /* TIMER 0 - LOW BYTE */
SFR(      TL1, 0x8B ); /* TIMER 1 - LOW BYTE */
SFR(      TH0, 0x8C ); /* TIMER 0 - HIGH BYTE */
SFR(      TH1, 0x8D ); /* TIMER 1 - HIGH BYTE */
SFR(   CKCON0, 0x8E ); /* CLOCK CONTROL */
SFR(    PSCTL, 0x8F ); /* PROGRAM STORE R/W CONTROL */
SFR(       P1, 0x90 ); /* PORT 1 */
SFR(  TMR3CN0, 0x91 ); /* TIMER 3 CONTROL */
SFR(  TMR3RLL, 0x92 ); /* TIMER 3 CAPTURE REGISTER - LOW BYTE */
SFR(  TMR3RLH, 0x93 ); /* TIMER 3 CAPTURE REGISTER - HIGH BYTE */
SFR(    TMR3L, 0x94 ); /* TIMER 3 - LOW BYTE */
SFR(    TMR3H, 0x95 ); /* TIMER 3 - HIGH BYTE */
SFR(  PCA0POL, 0x96 ); /* PCA Output Polarity */
SFR(    WDTCN, 0x97 ); /* Watchdog Timer Control*/
SFR(    SCON0, 0x98 ); /* SERIAL PORT CONTROL */
SFR(    SBUF0, 0x99 ); /* SERIAL PORT BUFFER */
SFR(  CMP0CN0, 0x9B ); /* COMPARATOR 0 CONTROL 0 */
SFR(  PCA0CLR, 0x9C ); /* PCA Comparator Clear Control */
SFR(   CMP0MD, 0x9D ); /* Comparator 0 Mode */
SFR( PCA0CENT, 0x9E ); /* PCA Center Alignment Enable */
SFR(   CMP0MX, 0x9F ); /* Comparator 0 Multiplexer Selection */
SFR(       P2, 0xA0 ); /* PORT 2 */
SFR(  SPI0CFG, 0xA1 ); /* SPI0 CONFIGURATION */
SFR(  SPI0CKR, 0xA2 ); /* SPI0 CLOCK RATE CONTROL */
SFR(  SPI0DAT, 0xA3 ); /* SPI0 DATA */
SFR(  P0MDOUT, 0xA4 ); /* PORT 0 OUTPUT MODE CONFIGURATION */
SFR(  P1MDOUT, 0xA5 ); /* PORT 1 OUTPUT MODE CONFIGURATION */
SFR(  P2MDOUT, 0xA6 ); /* PORT 2 OUTPUT MODE CONFIGURATION */
SFR(       IE, 0xA8 ); /* INTERRUPT ENABLE */
SFR(   CLKSEL, 0xA9 ); /* SYSTEM CLOCK SELECT */
SFR(   CMP1MX, 0xAA ); /* Comparator 1 Multiplexer Selection */
SFR(   CMP1MD, 0xAB ); /* Comparator 1 Mode */
SFR(   SMB0TC, 0xAC ); /* SMBus 0 Timing and Pin Control */
SFR(  DERIVID, 0xAD ); /* Derivative Identification */
SFR(   LFO0CN, 0xB1 ); /* Low Frequency Oscillator Control */
SFR(  ADC0CN1, 0xB2 ); /* ADC0 Control 1 */
SFR(   ADC0AC, 0xB3 ); /* ADC0 Accumulator Configuration */
SFR(  C2FPDAT, 0xB4 ); /* C2 Flash Programming Data */
SFR( DEVICEID, 0xB5 ); /* Device Identification */
SFR(    REVID, 0xB6 ); /* Revision Identifcation */
SFR(    FLKEY, 0xB7 ); /* Flash Lock and Key */
SFR(       IP, 0xB8 ); /* INTERRUPT PRIORITY */
SFR(   ADC0TK, 0xB9 ); /* ADC0 Burst Mode Track Time */
SFR(   ADC0MX, 0xBB ); /* ADC0 Multiplexer Selection */
SFR(   ADC0CF, 0xBC ); /* ADC 0 CONFIGURATION */
SFR(    ADC0L, 0xBD ); /* ADC 0 DATA WORD LSB */
SFR(    ADC0H, 0xBE ); /* ADC 0 DATA WORD MSB */
SFR(  CMP1CN0, 0xBF ); /* Comparator 1 Control 0 */
SFR(  SMB0CN0, 0xC0 ); /* SMBUS CONTROL */
SFR(   SMB0CF, 0xC1 ); /* SMBUS CONFIGURATION */
SFR(  SMB0DAT, 0xC2 ); /* SMBUS DATA */
SFR(  ADC0GTL, 0xC3 ); /* ADC 0 GREATER-THAN LOW BYTE */
SFR(  ADC0GTH, 0xC4 ); /* ADC 0 GREATER-THAN HIGH BYTE */
SFR(  ADC0LTL, 0xC5 ); /* ADC 0 LESS-THAN LOW BYTE */
SFR(  ADC0LTH, 0xC6 ); /* ADC 0 LESS-THAN HIGH BYTE */
SFR(  HFO0CAL, 0xC7 ); /* High Frequency Oscillator 0 Calibration */
SFR(  TMR2CN0, 0xC8 ); /* TIMER 2 CONTROL */
SFR(   REG0CN, 0xC9 ); /* TIMER 2 CONTROL */
SFR(  TMR2RLL, 0xCA ); /* TIMER 2 CAPTURE REGISTER - LOW BYTE */
SFR(  TMR2RLH, 0xCB ); /* TIMER 2 CAPTURE REGISTER - HIGH BYTE */
SFR(    TMR2L, 0xCC ); /* TIMER 2 - LOW BYTE */
SFR(    TMR2H, 0xCD ); /* TIMER 2 - HIGH BYTE */
SFR(  CRC0CN0, 0xCE ); /* CRC0 Control 0 */
SFR( CRC0FLIP, 0xCF ); /* CRC0 Bit Flip */
SFR(      PSW, 0xD0 ); /* PROGRAM STATUS WORD */
SFR(   REF0CN, 0xD1 ); /* VOLTAGE REFERENCE 0 CONTROL */
SFR( CRC0AUTO, 0xD2 ); /* CRC0 Automatic Control */
SFR(  CRC0CNT, 0xD3 ); /* CRC0 Automatic Flash Sector Count */
SFR(   P0SKIP, 0xD4 ); /* PORT 0 SKIP */
SFR(   P1SKIP, 0xD5 ); /* PORT 1 SKIP */
SFR(  SMB0ADM, 0xD6 ); /* SMBus 0 Slave Address Mask */
SFR(  SMB0ADR, 0xD7 ); /* SMBus 0 Slave Address */
SFR(  PCA0CN0, 0xD8 ); /* PCA CONTROL */
SFR(   PCA0MD, 0xD9 ); /* PCA MODE */
SFR( PCA0CPM0, 0xDA ); /* PCA MODULE 0 MODE REGISTER */
SFR( PCA0CPM1, 0xDB ); /* PCA MODULE 1 MODE REGISTER */
SFR( PCA0CPM2, 0xDC ); /* PCA MODULE 2 MODE REGISTER */
SFR(   CRC0IN, 0xDD ); /* CRC0 Data Input */
SFR(  CRC0DAT, 0xDE ); /* CRC0 Data Output */
SFR(  ADC0PWR, 0xDF ); /* ADC0 Power Control */
SFR(      ACC, 0xE0 ); /* ACCUMULATOR */
SFR(     XBR0, 0xE1 ); /* PORT MUX CONFIGURATION REGISTER 0 */
SFR(     XBR1, 0xE2 ); /* PORT MUX CONFIGURATION REGISTER 1 */
SFR(     XBR2, 0xE3 ); /* PORT MUX CONFIGURATION REGISTER 2 */
SFR(   IT01CF, 0xE4 ); /* INT0/INT1 CONFIGURATION REGISTER */
SFR(     EIE1, 0xE6 ); /* EXTERNAL INTERRUPT ENABLE 1 */
SFR(  ADC0CN0, 0xE8 ); /* ADC 0 CONTROL */
SFR( PCA0CPL1, 0xE9 ); /* PCA CAPTURE 1 LOW */
SFR( PCA0CPH1, 0xEA ); /* PCA CAPTURE 1 HIGH */
SFR( PCA0CPL2, 0xEB ); /* PCA CAPTURE 2 LOW */
SFR( PCA0CPH2, 0xEC ); /* PCA CAPTURE 2 HIGH */
SFR(    P1MAT, 0xED ); /* Port 1 Match */
SFR(   P1MASK, 0xEE ); /* Port 1 Mask */
SFR(   RSTSRC, 0xEF ); /* RESET SOURCE */
SFR(        B, 0xF0 ); /* B REGISTER */
SFR(   P0MDIN, 0xF1 ); /* PORT 0 INPUT MODE CONFIGURATION */
SFR(   P1MDIN, 0xF2 ); /* PORT 1 INPUT MODE CONFIGURATION */
SFR(     EIP1, 0xF3 ); /* EXTERNAL INTERRUPT PRIORITY REGISTER 1 */
SFR(   PRTDRV, 0xF6 ); /* Port Drive Strength */
SFR(  PCA0PWM, 0xF7 ); /* PCA PWM Configuration */
SFR(  SPI0CN0, 0xF8 ); /* SPI0 CONTROL */
SFR(    PCA0L, 0xF9 ); /* PCA COUNTER LOW */
SFR(    PCA0H, 0xFA ); /* PCA COUNTER HIGH */
SFR( PCA0CPL0, 0xFB ); /* PCA CAPTURE 0 LOW */
SFR( PCA0CPH0, 0xFC ); /* PCA CAPTURE 0 HIGH */
SFR(    P0MAT, 0xFD ); /* Port 0 Match */
SFR(   P0MASK, 0xFE ); /* Port 0 Mask */
SFR(   VDM0CN, 0xFF ); /* Supply Monitor Control */


/*  WORD/DWORD Registers  */

SFR16E(  TMR0, 0x8C8A ); /* TIMER 0 COUNTER */
SFR16E(  TMR1, 0x8D8B ); /* TIMER 1 COUNTER */
SFR16(     TMR2, 0xCC ); /* TIMER 2 COUNTER */
SFR16(   TMR2RL, 0xCA ); /* TIMER 2 CAPTURE REGISTER WORD */
SFR16(     TMR3, 0x94 ); /* TIMER 3 COUNTER */
SFR16(   TMR3RL, 0x92 ); /* TIMER 3 CAPTURE REGISTER WORD */
SFR16(     ADC0, 0xBD ); /* ADC 0 DATA WORD */
SFR16(   ADC0GT, 0xC3 ); /* ADC 0 GREATER-THAN REGISTER WORD */
SFR16(   ADC0LT, 0xC5 ); /* ADC 0 LESS-THAN REGISTER WORD */
SFR16(     PCA0, 0xF9 ); /* PCA COUNTER */
SFR16(  PCA0CP0, 0xFB ); /* PCA CAPTURE 0 WORD */
SFR16(  PCA0CP1, 0xE9 ); /* PCA CAPTURE 1 WORD */
SFR16(  PCA0CP2, 0xEB ); /* PCA CAPTURE 2 WORD */

/*  BIT Registers  */

/*  P0  0x80 */
SBIT(     P0_0, 0x80, 0 ); /* Port 0 bit 0 */
SBIT(     P0_1, 0x80, 1 ); /* Port 0 bit 1 */
SBIT(     P0_2, 0x80, 2 ); /* Port 0 bit 2 */
SBIT(     P0_3, 0x80, 3 ); /* Port 0 bit 3 */
SBIT(     P0_4, 0x80, 4 ); /* Port 0 bit 4 */
SBIT(     P0_5, 0x80, 5 ); /* Port 0 bit 5 */
SBIT(     P0_6, 0x80, 6 ); /* Port 0 bit 6 */
SBIT(     P0_7, 0x80, 7 ); /* Port 0 bit 7 */

/*  TCON  0x88 */
SBIT(      IT0, 0x88, 0 ); /* TCON.0 - EXT. INTERRUPT 0 TYPE */
SBIT(      IE0, 0x88, 1 ); /* TCON.1 - EXT. INTERRUPT 0 EDGE FLAG */
SBIT(      IT1, 0x88, 2 ); /* TCON.2 - EXT. INTERRUPT 1 TYPE */
SBIT(      IE1, 0x88, 3 ); /* TCON.3 - EXT. INTERRUPT 1 EDGE FLAG */
SBIT(      TR0, 0x88, 4 ); /* TCON.4 - TIMER 0 ON/OFF CONTROL */
SBIT(      TF0, 0x88, 5 ); /* TCON.5 - TIMER 0 OVERFLOW FLAG */
SBIT(      TR1, 0x88, 6 ); /* TCON.6 - TIMER 1 ON/OFF CONTROL */
SBIT(      TF1, 0x88, 7 ); /* TCON.7 - TIMER 1 OVERFLOW FLAG */

