OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/* Predefined SFR Bit Masks */

#define PCON_IDLE         0x01    /* PCON */
#define PCON_STOP         0x02    /* PCON */
#define T1M               0x08    /* CKCON */
#define PSWE              0x01    /* PSCTL */
#define PSEE              0x02    /* PSCTL */
#define ECP0              0x20    /* EIE1 */
#define ECP1              0x40    /* EIE1 */
#define PORSF             0x02    /* RSTSRC */
#define SWRSF             0x10    /* RSTSRC */
#define ECCF              0x01    /* PCA0CPMn */
#define PWM               0x02    /* PCA0CPMn */
#define TOG               0x04    /* PCA0CPMn */
#define MAT               0x08    /* PCA0CPMn */
#define CAPN              0x10    /* PCA0CPMn */
#define CAPP              0x20    /* PCA0CPMn */
#define ECOM              0x40    /* PCA0CPMn */
#define PWM16             0x80    /* PCA0CPMn */
#define CP0E              0x10    /* XBR0 */
#define CP0OEN            0x10    /* XBR0 */
#define CP0AE             0x20    /* XBR0 */
#define CP0AOEN           0x20    /* XBR0 */
#define CP1E              0x40    /* XBR0 */
#define CP1AE             0x80    /* XBR0 */

/* Interrupts */

#define EXT0_VECTOR          0      /* External Interrupt 0 */
#define TIMER0_VECTOR        1      /* Timer0 Overflow */
#define EXT1_VECTOR          2      /* External Interrupt 1 */
#define TIMER1_VECTOR        3      /* Timer1 Overflow */
#define UART0_VECTOR         4      /* Serial Port 0 */
#define TIMER2_VECTOR        5      /* Timer2 Overflow */
#define SPI0_VECTOR          6      /* Serial Peripheral Interface 0 */
#define SMBUS0_VECTOR        7      /* SMBus0 Interface */
#define PMAT_VECTOR          8      /* Port Match */
#define ADC0_WINDOW_VECTOR   9      /* ADC0 Window Comparison */
#define ADC0_EOC_VECTOR      10     /* ADC0 End Of Conversion */
#define PCA0_VECTOR          11     /* PCA0 Peripheral */
#define CMP0_VECTOR          12     /* Comparator0 */
#define CMP1_VECTOR          13     /* Comparator1 */
#define TIMER3_VECTOR        14     /* Timer3 Overflow */

/*------------------------------------------------------------------------------ */
/* ADC0CN0 Enums (ADC0 Control 0 @ 0xE8)                                         */
/*------------------------------------------------------------------------------ */
#define ADCM__FMASK            0x07 /* Start of Conversion Mode Select */
#define ADCM__SHIFT            0x00 /* Start of Conversion Mode Select */
#define ADCM__ADBUSY           0x00 /* ADC0 conversion initiated on write of 1 to ADBUSY. */
#define ADCM__TIMER0           0x01 /* ADC0 conversion initiated on overflow of Timer 0. */
#define ADCM__TIMER2           0x02 /* ADC0 conversion initiated on overflow of Timer 2. */
#define ADCM__TIMER3           0x03 /* ADC0 conversion initiated on overflow of Timer 3. */
#define ADCM__CNVSTR           0x04 /* ADC0 conversion initiated on rising edge of CNVSTR. */

#define ADWINT__BMASK          0x08 /* Window Compare Interrupt Flag */
#define ADWINT__SHIFT          0x03 /* Window Compare Interrupt Flag */
#define ADWINT__NOT_SET        0x00 /* An ADC window compare event did not occur. */
#define ADWINT__SET            0x08 /* An ADC window compare event occurred. */

#define ADBUSY__BMASK          0x10 /* ADC Busy */
#define ADBUSY__SHIFT          0x04 /* ADC Busy */
#define ADBUSY__NOT_SET        0x00 /* An ADC0 conversion is not currently in progress. */
#define ADBUSY__SET            0x10 /* ADC0 conversion is in progress or start an ADC0 conversion. */

#define ADINT__BMASK           0x20 /* Conversion Complete Interrupt Flag */
#define ADINT__SHIFT           0x05 /* Conversion Complete Interrupt Flag */
#define ADINT__NOT_SET         0x00 /* ADC0 has not completed a conversion since the last time ADINT was cleared. */
#define ADINT__SET             0x20 /* ADC0 completed a data conversion. */

#define ADBMEN__BMASK          0x40 /* Burst Mode Enable */
#define ADBMEN__SHIFT          0x06 /* Burst Mode Enable */
#define ADBMEN__BURST_DISABLED 0x00 /* Disable ADC0 burst mode. */
#define ADBMEN__BURST_ENABLED  0x40 /* Enable ADC0 burst mode. */

#define ADEN__BMASK            0x80 /* ADC Enable */
#define ADEN__SHIFT            0x07 /* ADC Enable */
#define ADEN__DISABLED         0x00 /* Disable ADC0 (low-power shutdown). */
#define ADEN__ENABLED          0x80 /* Enable ADC0 (active and ready for data conversions). */

/*------------------------------------------------------------------------------ */
/* ADC0AC Enums (ADC0 Accumulator Configuration @ 0xB3)                          */
/*------------------------------------------------------------------------------ */
#define AD0RPT__FMASK            0x07 /* Repeat Count */
#define AD0RPT__SHIFT            0x00 /* Repeat Count */
#define AD0RPT__ACC_1            0x00 /* Perform and Accumulate 1 conversion (not used in 12-bit mode). */
#define AD0RPT__ACC_4            0x01 /* Perform and Accumulate 4 conversions (1 conversion in 12-bit mode). */
#define AD0RPT__ACC_8            0x02 /* Perform and Accumulate 8 conversions (2 conversions in 12-bit mode). */
#define AD0RPT__ACC_16           0x03 /* Perform and Accumulate 16 conversions (4 conversions in 12-bit mode). */
#define AD0RPT__ACC_32           0x04 /* Perform and Accumulate 32 conversions (8 conversions in 12-bit mode). */
#define AD0RPT__ACC_64           0x05 /* Perform and Accumulate 64 conversions (16 conversions in 12-bit mode). */

#define AD0SJST__FMASK           0x38 /* Accumulator Shift and Justify */
#define AD0SJST__SHIFT           0x03 /* Accumulator Shift and Justify */
#define AD0SJST__RIGHT_NO_SHIFT  0x00 /* Right justified. No shifting applied. */
#define AD0SJST__RIGHT_SHIFT_1   0x08 /* Right justified. Shifted right by 1 bit. */
#define AD0SJST__RIGHT_SHIFT_2   0x10 /* Right justified. Shifted right by 2 bits. */
#define AD0SJST__RIGHT_SHIFT_3   0x18 /* Right justified. Shifted right by 3 bits. */
#define AD0SJST__LEFT_NO_SHIFT   0x20 /* Left justified. No shifting applied. */

#define AD0AE__BMASK             0x40 /* Accumulate Enable */
#define AD0AE__SHIFT             0x06 /* Accumulate Enable */
#define AD0AE__ACC_DISABLED      0x00 /* ADC0H:ADC0L contain the result of the latest conversion when Burst Mode is disabled. */
#define AD0AE__ACC_ENABLED       0x40 /* ADC0H:ADC0L contain the accumulated conversion results when Burst Mode is disabled. Firmware must write 0x0000 to ADC0H:ADC0L to clear the accumulated result. */

#define AD12BE__BMASK            0x80 /* 12-Bit Mode Enable */
#define AD12BE__SHIFT            0x07 /* 12-Bit Mode Enable */
#define AD12BE__12_BIT_DISABLED  0x00 /* Disable 12-bit mode. */
#define AD12BE__12_BIT_ENABLED   0x80 /* Enable 12-bit mode. */

