OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*------------------------------------------------------------------------------ */
/* ADC0CF Enums (ADC0 Configuration @ 0xBC)                                      */
/*------------------------------------------------------------------------------ */
#define ADGN__BMASK         0x01 /* Gain Control */
#define ADGN__SHIFT         0x00 /* Gain Control */
#define ADGN__GAIN_0P5      0x00 /* The on-chip PGA gain is 0.5. */
#define ADGN__GAIN_1        0x01 /* The on-chip PGA gain is 1. */

#define ADTM__BMASK         0x02 /* Track Mode */
#define ADTM__SHIFT         0x01 /* Track Mode */
#define ADTM__TRACK_NORMAL  0x00 /* Normal Track Mode. When ADC0 is enabled, conversion begins immediately following the start-of-conversion signal. */
#define ADTM__TRACK_DELAYED 0x02 /* Delayed Track Mode. When ADC0 is enabled, conversion begins 4 SAR clock cycles following the start-of-conversion signal. The ADC is allowed to track during this time. */

#define AD8BE__BMASK        0x04 /* 8-Bit Mode Enable */
#define AD8BE__SHIFT        0x02 /* 8-Bit Mode Enable */
#define AD8BE__NORMAL       0x00 /* ADC0 operates in 10-bit or 12-bit mode (normal operation). */
#define AD8BE__8_BIT        0x04 /* ADC0 operates in 8-bit mode. */

#define ADSC__FMASK         0xF8 /* SAR Clock Divider */
#define ADSC__SHIFT         0x03 /* SAR Clock Divider */

/*------------------------------------------------------------------------------ */
/* P0MDIN Enums (Port 0 Input Mode @ 0xF1)                                       */
/*------------------------------------------------------------------------------ */
#define B0__BMASK   0x01 /* Port 0 Bit 0 Input Mode */
#define B0__SHIFT   0x00 /* Port 0 Bit 0 Input Mode */
#define B0__ANALOG  0x00 /* P0.0 pin is configured for analog mode. */
#define B0__DIGITAL 0x01 /* P0.0 pin is configured for digital mode. */

#define B1__BMASK   0x02 /* Port 0 Bit 1 Input Mode */
#define B1__SHIFT   0x01 /* Port 0 Bit 1 Input Mode */
#define B1__ANALOG  0x00 /* P0.1 pin is configured for analog mode. */
#define B1__DIGITAL 0x02 /* P0.1 pin is configured for digital mode. */

#define B2__BMASK   0x04 /* Port 0 Bit 2 Input Mode */
#define B2__SHIFT   0x02 /* Port 0 Bit 2 Input Mode */
#define B2__ANALOG  0x00 /* P0.2 pin is configured for analog mode. */
#define B2__DIGITAL 0x04 /* P0.2 pin is configured for digital mode. */

#define B3__BMASK   0x08 /* Port 0 Bit 3 Input Mode */
#define B3__SHIFT   0x03 /* Port 0 Bit 3 Input Mode */
#define B3__ANALOG  0x00 /* P0.3 pin is configured for analog mode. */
#define B3__DIGITAL 0x08 /* P0.3 pin is configured for digital mode. */

#define B4__BMASK   0x10 /* Port 0 Bit 4 Input Mode */
#define B4__SHIFT   0x04 /* Port 0 Bit 4 Input Mode */
#define B4__ANALOG  0x00 /* P0.4 pin is configured for analog mode. */
#define B4__DIGITAL 0x10 /* P0.4 pin is configured for digital mode. */

#define B5__BMASK   0x20 /* Port 0 Bit 5 Input Mode */
#define B5__SHIFT   0x05 /* Port 0 Bit 5 Input Mode */
#define B5__ANALOG  0x00 /* P0.5 pin is configured for analog mode. */
#define B5__DIGITAL 0x20 /* P0.5 pin is configured for digital mode. */

#define B6__BMASK   0x40 /* Port 0 Bit 6 Input Mode */
#define B6__SHIFT   0x06 /* Port 0 Bit 6 Input Mode */
#define B6__ANALOG  0x00 /* P0.6 pin is configured for analog mode. */
#define B6__DIGITAL 0x40 /* P0.6 pin is configured for digital mode. */

#define B7__BMASK   0x80 /* Port 0 Bit 7 Input Mode */
#define B7__SHIFT   0x07 /* Port 0 Bit 7 Input Mode */
#define B7__ANALOG  0x00 /* P0.7 pin is configured for analog mode. */
#define B7__DIGITAL 0x80 /* P0.7 pin is configured for digital mode. */

/*------------------------------------------------------------------------------ */
/* P0MDOUT Enums (Port 0 Output Mode @ 0xA4)                                     */
/*------------------------------------------------------------------------------ */
#define B0__BMASK      0x01 /* Port 0 Bit 0 Output Mode */
#define B0__SHIFT      0x00 /* Port 0 Bit 0 Output Mode */
#define B0__OPEN_DRAIN 0x00 /* P0.0 output is open-drain. */
#define B0__PUSH_PULL  0x01 /* P0.0 output is push-pull. */

#define B1__BMASK      0x02 /* Port 0 Bit 1 Output Mode */
#define B1__SHIFT      0x01 /* Port 0 Bit 1 Output Mode */
#define B1__OPEN_DRAIN 0x00 /* P0.1 output is open-drain. */
#define B1__PUSH_PULL  0x02 /* P0.1 output is push-pull. */

#define B2__BMASK      0x04 /* Port 0 Bit 2 Output Mode */
#define B2__SHIFT      0x02 /* Port 0 Bit 2 Output Mode */
#define B2__OPEN_DRAIN 0x00 /* P0.2 output is open-drain. */
#define B2__PUSH_PULL  0x04 /* P0.2 output is push-pull. */

#define B3__BMASK      0x08 /* Port 0 Bit 3 Output Mode */
#define B3__SHIFT      0x03 /* Port 0 Bit 3 Output Mode */
#define B3__OPEN_DRAIN 0x00 /* P0.3 output is open-drain. */
#define B3__PUSH_PULL  0x08 /* P0.3 output is push-pull. */

#define B4__BMASK      0x10 /* Port 0 Bit 4 Output Mode */
#define B4__SHIFT      0x04 /* Port 0 Bit 4 Output Mode */
#define B4__OPEN_DRAIN 0x00 /* P0.4 output is open-drain. */
#define B4__PUSH_PULL  0x10 /* P0.4 output is push-pull. */

#define B5__BMASK      0x20 /* Port 0 Bit 5 Output Mode */
#define B5__SHIFT      0x05 /* Port 0 Bit 5 Output Mode */
#define B5__OPEN_DRAIN 0x00 /* P0.5 output is open-drain. */
#define B5__PUSH_PULL  0x20 /* P0.5 output is push-pull. */

#define B6__BMASK      0x40 /* Port 0 Bit 6 Output Mode */
#define B6__SHIFT      0x06 /* Port 0 Bit 6 Output Mode */
#define B6__OPEN_DRAIN 0x00 /* P0.6 output is open-drain. */
#define B6__PUSH_PULL  0x40 /* P0.6 output is push-pull. */

#define B7__BMASK      0x80 /* Port 0 Bit 7 Output Mode */
#define B7__SHIFT      0x07 /* Port 0 Bit 7 Output Mode */
#define B7__OPEN_DRAIN 0x00 /* P0.7 output is open-drain. */
#define B7__PUSH_PULL  0x80 /* P0.7 output is push-pull. */

/*------------------------------------------------------------------------------ */
/* P0SKIP Enums (Port 0 Skip @ 0xD4)                                             */
/*------------------------------------------------------------------------------ */
#define B0__BMASK       0x01 /* Port 0 Bit 0 Skip */
#define B0__SHIFT       0x00 /* Port 0 Bit 0 Skip */
#define B0__NOT_SKIPPED 0x00 /* P0.0 pin is not skipped by the crossbar. */
#define B0__SKIPPED     0x01 /* P0.0 pin is skipped by the crossbar. */

