OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define B1__BMASK       0x02 /* Port 0 Bit 1 Skip */
#define B1__SHIFT       0x01 /* Port 0 Bit 1 Skip */
#define B1__NOT_SKIPPED 0x00 /* P0.1 pin is not skipped by the crossbar. */
#define B1__SKIPPED     0x02 /* P0.1 pin is skipped by the crossbar. */

#define B2__BMASK       0x04 /* Port 0 Bit 2 Skip */
#define B2__SHIFT       0x02 /* Port 0 Bit 2 Skip */
#define B2__NOT_SKIPPED 0x00 /* P0.2 pin is not skipped by the crossbar. */
#define B2__SKIPPED     0x04 /* P0.2 pin is skipped by the crossbar. */

#define B3__BMASK       0x08 /* Port 0 Bit 3 Skip */
#define B3__SHIFT       0x03 /* Port 0 Bit 3 Skip */
#define B3__NOT_SKIPPED 0x00 /* P0.3 pin is not skipped by the crossbar. */
#define B3__SKIPPED     0x08 /* P0.3 pin is skipped by the crossbar. */

#define B4__BMASK       0x10 /* Port 0 Bit 4 Skip */
#define B4__SHIFT       0x04 /* Port 0 Bit 4 Skip */
#define B4__NOT_SKIPPED 0x00 /* P0.4 pin is not skipped by the crossbar. */
#define B4__SKIPPED     0x10 /* P0.4 pin is skipped by the crossbar. */

#define B5__BMASK       0x20 /* Port 0 Bit 5 Skip */
#define B5__SHIFT       0x05 /* Port 0 Bit 5 Skip */
#define B5__NOT_SKIPPED 0x00 /* P0.5 pin is not skipped by the crossbar. */
#define B5__SKIPPED     0x20 /* P0.5 pin is skipped by the crossbar. */

#define B6__BMASK       0x40 /* Port 0 Bit 6 Skip */
#define B6__SHIFT       0x06 /* Port 0 Bit 6 Skip */
#define B6__NOT_SKIPPED 0x00 /* P0.6 pin is not skipped by the crossbar. */
#define B6__SKIPPED     0x40 /* P0.6 pin is skipped by the crossbar. */

#define B7__BMASK       0x80 /* Port 0 Bit 7 Skip */
#define B7__SHIFT       0x07 /* Port 0 Bit 7 Skip */
#define B7__NOT_SKIPPED 0x00 /* P0.7 pin is not skipped by the crossbar. */
#define B7__SKIPPED     0x80 /* P0.7 pin is skipped by the crossbar. */

/*------------------------------------------------------------------------------ */
/* P0 Enums (Port 0 Pin Latch @ 0x80)                                            */
/*------------------------------------------------------------------------------ */
#define B0__BMASK 0x01 /* Port 0 Bit 0 Latch */
#define B0__SHIFT 0x00 /* Port 0 Bit 0 Latch */
#define B0__LOW   0x00 /* P0.0 is low. Set P0.0 to drive low. */
#define B0__HIGH  0x01 /* P0.0 is high. Set P0.0 to drive or float high. */

#define B1__BMASK 0x02 /* Port 0 Bit 1 Latch */
#define B1__SHIFT 0x01 /* Port 0 Bit 1 Latch */
#define B1__LOW   0x00 /* P0.1 is low. Set P0.1 to drive low. */
#define B1__HIGH  0x02 /* P0.1 is high. Set P0.1 to drive or float high. */

#define B2__BMASK 0x04 /* Port 0 Bit 2 Latch */
#define B2__SHIFT 0x02 /* Port 0 Bit 2 Latch */
#define B2__LOW   0x00 /* P0.2 is low. Set P0.2 to drive low. */
#define B2__HIGH  0x04 /* P0.2 is high. Set P0.2 to drive or float high. */

#define B3__BMASK 0x08 /* Port 0 Bit 3 Latch */
#define B3__SHIFT 0x03 /* Port 0 Bit 3 Latch */
#define B3__LOW   0x00 /* P0.3 is low. Set P0.3 to drive low. */
#define B3__HIGH  0x08 /* P0.3 is high. Set P0.3 to drive or float high. */

#define B4__BMASK 0x10 /* Port 0 Bit 4 Latch */
#define B4__SHIFT 0x04 /* Port 0 Bit 4 Latch */
#define B4__LOW   0x00 /* P0.4 is low. Set P0.4 to drive low. */
#define B4__HIGH  0x10 /* P0.4 is high. Set P0.4 to drive or float high. */

#define B5__BMASK 0x20 /* Port 0 Bit 5 Latch */
#define B5__SHIFT 0x05 /* Port 0 Bit 5 Latch */
#define B5__LOW   0x00 /* P0.5 is low. Set P0.5 to drive low. */
#define B5__HIGH  0x20 /* P0.5 is high. Set P0.5 to drive or float high. */

#define B6__BMASK 0x40 /* Port 0 Bit 6 Latch */
#define B6__SHIFT 0x06 /* Port 0 Bit 6 Latch */
#define B6__LOW   0x00 /* P0.6 is low. Set P0.6 to drive low. */
#define B6__HIGH  0x40 /* P0.6 is high. Set P0.6 to drive or float high. */

#define B7__BMASK 0x80 /* Port 0 Bit 7 Latch */
#define B7__SHIFT 0x07 /* Port 0 Bit 7 Latch */
#define B7__LOW   0x00 /* P0.7 is low. Set P0.7 to drive low. */
#define B7__HIGH  0x80 /* P0.7 is high. Set P0.7 to drive or float high. */

/*------------------------------------------------------------------------------ */
/* P0MASK Enums (Port 0 Mask @ 0xFE)                                             */
/*------------------------------------------------------------------------------ */
#define B0__BMASK    0x01 /* Port 0 Bit 0 Mask Value */
#define B0__SHIFT    0x00 /* Port 0 Bit 0 Mask Value */
#define B0__IGNORED  0x00 /* P0.0 pin logic value is ignored and will not cause a port mismatch event. */
#define B0__COMPARED 0x01 /* P0.0 pin logic value is compared to P0MAT.0. */

#define B1__BMASK    0x02 /* Port 0 Bit 1 Mask Value */
#define B1__SHIFT    0x01 /* Port 0 Bit 1 Mask Value */
#define B1__IGNORED  0x00 /* P0.1 pin logic value is ignored and will not cause a port mismatch event. */
#define B1__COMPARED 0x02 /* P0.1 pin logic value is compared to P0MAT.1. */

#define B2__BMASK    0x04 /* Port 0 Bit 2 Mask Value */
#define B2__SHIFT    0x02 /* Port 0 Bit 2 Mask Value */
#define B2__IGNORED  0x00 /* P0.2 pin logic value is ignored and will not cause a port mismatch event. */
#define B2__COMPARED 0x04 /* P0.2 pin logic value is compared to P0MAT.2. */

#define B3__BMASK    0x08 /* Port 0 Bit 3 Mask Value */
#define B3__SHIFT    0x03 /* Port 0 Bit 3 Mask Value */
#define B3__IGNORED  0x00 /* P0.3 pin logic value is ignored and will not cause a port mismatch event. */
#define B3__COMPARED 0x08 /* P0.3 pin logic value is compared to P0MAT.3. */

#define B4__BMASK    0x10 /* Port 0 Bit 4 Mask Value */
#define B4__SHIFT    0x04 /* Port 0 Bit 4 Mask Value */
#define B4__IGNORED  0x00 /* P0.4 pin logic value is ignored and will not cause a port mismatch event. */
#define B4__COMPARED 0x10 /* P0.4 pin logic value is compared to P0MAT.4. */

#define B5__BMASK    0x20 /* Port 0 Bit 5 Mask Value */
#define B5__SHIFT    0x05 /* Port 0 Bit 5 Mask Value */
#define B5__IGNORED  0x00 /* P0.5 pin logic value is ignored and will not cause a port mismatch event. */
#define B5__COMPARED 0x20 /* P0.5 pin logic value is compared to P0MAT.5. */

#define B6__BMASK    0x40 /* Port 0 Bit 6 Mask Value */
#define B6__SHIFT    0x06 /* Port 0 Bit 6 Mask Value */
#define B6__IGNORED  0x00 /* P0.6 pin logic value is ignored and will not cause a port mismatch event. */
#define B6__COMPARED 0x40 /* P0.6 pin logic value is compared to P0MAT.6. */

#define B7__BMASK    0x80 /* Port 0 Bit 7 Mask Value */
#define B7__SHIFT    0x07 /* Port 0 Bit 7 Mask Value */
#define B7__IGNORED  0x00 /* P0.7 pin logic value is ignored and will not cause a port mismatch event. */
#define B7__COMPARED 0x80 /* P0.7 pin logic value is compared to P0MAT.7. */

