OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*------------------------------------------------------------------------------ */
/* P0MAT Enums (Port 0 Match @ 0xFD) */
/*------------------------------------------------------------------------------ */
#define B0__BMASK 0x01 /* Port 0 Bit 0 Match Value */
#define B0__SHIFT 0x00 /* Port 0 Bit 0 Match Value */
#define B0__LOW   0x00 /* P0.0 pin logic value is compared with logic LOW. */
#define B0__HIGH  0x01 /* P0.0 pin logic value is compared with logic HIGH. */

#define B1__BMASK 0x02 /* Port 0 Bit 1 Match Value */
#define B1__SHIFT 0x01 /* Port 0 Bit 1 Match Value */
#define B1__LOW   0x00 /* P0.1 pin logic value is compared with logic LOW. */
#define B1__HIGH  0x02 /* P0.1 pin logic value is compared with logic HIGH. */

#define B2__BMASK 0x04 /* Port 0 Bit 2 Match Value */
#define B2__SHIFT 0x02 /* Port 0 Bit 2 Match Value */
#define B2__LOW   0x00 /* P0.2 pin logic value is compared with logic LOW. */
#define B2__HIGH  0x04 /* P0.2 pin logic value is compared with logic HIGH. */

#define B3__BMASK 0x08 /* Port 0 Bit 3 Match Value */
#define B3__SHIFT 0x03 /* Port 0 Bit 3 Match Value */
#define B3__LOW   0x00 /* P0.3 pin logic value is compared with logic LOW. */
#define B3__HIGH  0x08 /* P0.3 pin logic value is compared with logic HIGH. */

#define B4__BMASK 0x10 /* Port 0 Bit 4 Match Value */
#define B4__SHIFT 0x04 /* Port 0 Bit 4 Match Value */
#define B4__LOW   0x00 /* P0.4 pin logic value is compared with logic LOW. */
#define B4__HIGH  0x10 /* P0.4 pin logic value is compared with logic HIGH. */

#define B5__BMASK 0x20 /* Port 0 Bit 5 Match Value */
#define B5__SHIFT 0x05 /* Port 0 Bit 5 Match Value */
#define B5__LOW   0x00 /* P0.5 pin logic value is compared with logic LOW. */
#define B5__HIGH  0x20 /* P0.5 pin logic value is compared with logic HIGH. */

#define B6__BMASK 0x40 /* Port 0 Bit 6 Match Value */
#define B6__SHIFT 0x06 /* Port 0 Bit 6 Match Value */
#define B6__LOW   0x00 /* P0.6 pin logic value is compared with logic LOW. */
#define B6__HIGH  0x40 /* P0.6 pin logic value is compared with logic HIGH. */

#define B7__BMASK 0x80 /* Port 0 Bit 7 Match Value */
#define B7__SHIFT 0x07 /* Port 0 Bit 7 Match Value */
#define B7__LOW   0x00 /* P0.7 pin logic value is compared with logic LOW. */
#define B7__HIGH  0x80 /* P0.7 pin logic value is compared with logic HIGH. */

/*------------------------------------------------------------------------------ */
/* P1 Enums (Port 1 Pin Latch @ 0x90) */
/*------------------------------------------------------------------------------ */
#define B0__BMASK 0x01 /* Port 1 Bit 0 Latch */
#define B0__SHIFT 0x00 /* Port 1 Bit 0 Latch */
#define B0__LOW   0x00 /* P1.0 is low. Set P1.0 to drive low. */
#define B0__HIGH  0x01 /* P1.0 is high. Set P1.0 to drive or float high. */

#define B1__BMASK 0x02 /* Port 1 Bit 1 Latch */
#define B1__SHIFT 0x01 /* Port 1 Bit 1 Latch */
#define B1__LOW   0x00 /* P1.1 is low. Set P1.1 to drive low. */
#define B1__HIGH  0x02 /* P1.1 is high. Set P1.1 to drive or float high. */

#define B2__BMASK 0x04 /* Port 1 Bit 2 Latch */
#define B2__SHIFT 0x02 /* Port 1 Bit 2 Latch */
#define B2__LOW   0x00 /* P1.2 is low. Set P1.2 to drive low. */
#define B2__HIGH  0x04 /* P1.2 is high. Set P1.2 to drive or float high. */

#define B3__BMASK 0x08 /* Port 1 Bit 3 Latch */
#define B3__SHIFT 0x03 /* Port 1 Bit 3 Latch */
#define B3__LOW   0x00 /* P1.3 is low. Set P1.3 to drive low. */
#define B3__HIGH  0x08 /* P1.3 is high. Set P1.3 to drive or float high. */

#define B4__BMASK 0x10 /* Port 1 Bit 4 Latch */
#define B4__SHIFT 0x04 /* Port 1 Bit 4 Latch */
#define B4__LOW   0x00 /* P1.4 is low. Set P1.4 to drive low. */
#define B4__HIGH  0x10 /* P1.4 is high. Set P1.4 to drive or float high. */

#define B5__BMASK 0x20 /* Port 1 Bit 5 Latch */
#define B5__SHIFT 0x05 /* Port 1 Bit 5 Latch */
#define B5__LOW   0x00 /* P1.5 is low. Set P1.5 to drive low. */
#define B5__HIGH  0x20 /* P1.5 is high. Set P1.5 to drive or float high. */

#define B6__BMASK 0x40 /* Port 1 Bit 6 Latch */
#define B6__SHIFT 0x06 /* Port 1 Bit 6 Latch */
#define B6__LOW   0x00 /* P1.6 is low. Set P1.6 to drive low. */
#define B6__HIGH  0x40 /* P1.6 is high. Set P1.6 to drive or float high. */

#define B7__BMASK 0x80 /* Port 1 Bit 7 Latch */
#define B7__SHIFT 0x07 /* Port 1 Bit 7 Latch */
#define B7__LOW   0x00 /* P1.7 is low. Set P1.7 to drive low. */
#define B7__HIGH  0x80 /* P1.7 is high. Set P1.7 to drive or float high. */

/*------------------------------------------------------------------------------ */
/* P1MASK Enums (Port 1 Mask @ 0xEE) */
/*------------------------------------------------------------------------------ */
#define B0__BMASK    0x01 /* Port 1 Bit 0 Mask Value */
#define B0__SHIFT    0x00 /* Port 1 Bit 0 Mask Value */
#define B0__IGNORED  0x00 /* P1.0 pin logic value is ignored and will not cause a port mismatch event. */
#define B0__COMPARED 0x01 /* P1.0 pin logic value is compared to P1MAT.0. */

#define B1__BMASK    0x02 /* Port 1 Bit 1 Mask Value */
#define B1__SHIFT    0x01 /* Port 1 Bit 1 Mask Value */
#define B1__IGNORED  0x00 /* P1.1 pin logic value is ignored and will not cause a port mismatch event. */
#define B1__COMPARED 0x02 /* P1.1 pin logic value is compared to P1MAT.1. */

#define B2__BMASK    0x04 /* Port 1 Bit 2 Mask Value */
#define B2__SHIFT    0x02 /* Port 1 Bit 2 Mask Value */
#define B2__IGNORED  0x00 /* P1.2 pin logic value is ignored and will not cause a port mismatch event. */
#define B2__COMPARED 0x04 /* P1.2 pin logic value is compared to P1MAT.2. */

#define B3__BMASK    0x08 /* Port 1 Bit 3 Mask Value */
#define B3__SHIFT    0x03 /* Port 1 Bit 3 Mask Value */
#define B3__IGNORED  0x00 /* P1.3 pin logic value is ignored and will not cause a port mismatch event. */
#define B3__COMPARED 0x08 /* P1.3 pin logic value is compared to P1MAT.3. */

#define B4__BMASK    0x10 /* Port 1 Bit 4 Mask Value */
#define B4__SHIFT    0x04 /* Port 1 Bit 4 Mask Value */
#define B4__IGNORED  0x00 /* P1.4 pin logic value is ignored and will not cause a port mismatch event. */
#define B4__COMPARED 0x10 /* P1.4 pin logic value is compared to P1MAT.4. */

#define B5__BMASK    0x20 /* Port 1 Bit 5 Mask Value */
#define B5__SHIFT    0x05 /* Port 1 Bit 5 Mask Value */
#define B5__IGNORED  0x00 /* P1.5 pin logic value is ignored and will not cause a port mismatch event. */
#define B5__COMPARED 0x20 /* P1.5 pin logic value is compared to P1MAT.5. */

