OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define B6__BMASK    0x40 /* Port 1 Bit 6 Mask Value */
#define B6__SHIFT    0x06 /* Port 1 Bit 6 Mask Value */
#define B6__IGNORED  0x00 /* P1.6 pin logic value is ignored and will not cause a port mismatch event. */
#define B6__COMPARED 0x40 /* P1.6 pin logic value is compared to P1MAT.6. */

#define B7__BMASK    0x80 /* Port 1 Bit 7 Mask Value */
#define B7__SHIFT    0x07 /* Port 1 Bit 7 Mask Value */
#define B7__IGNORED  0x00 /* P1.7 pin logic value is ignored and will not cause a port mismatch event. */
#define B7__COMPARED 0x80 /* P1.7 pin logic value is compared to P1MAT.7. */

/*------------------------------------------------------------------------------ */
/* P1MAT Enums (Port 1 Match @ 0xED) */
/*------------------------------------------------------------------------------ */
#define B0__BMASK 0x01 /* Port 1 Bit 0 Match Value */
#define B0__SHIFT 0x00 /* Port 1 Bit 0 Match Value */
#define B0__LOW   0x00 /* P1.0 pin logic value is compared with logic LOW. */
#define B0__HIGH  0x01 /* P1.0 pin logic value is compared with logic HIGH. */

#define B1__BMASK 0x02 /* Port 1 Bit 1 Match Value */
#define B1__SHIFT 0x01 /* Port 1 Bit 1 Match Value */
#define B1__LOW   0x00 /* P1.1 pin logic value is compared with logic LOW. */
#define B1__HIGH  0x02 /* P1.1 pin logic value is compared with logic HIGH. */

#define B2__BMASK 0x04 /* Port 1 Bit 2 Match Value */
#define B2__SHIFT 0x02 /* Port 1 Bit 2 Match Value */
#define B2__LOW   0x00 /* P1.2 pin logic value is compared with logic LOW. */
#define B2__HIGH  0x04 /* P1.2 pin logic value is compared with logic HIGH. */

#define B3__BMASK 0x08 /* Port 1 Bit 3 Match Value */
#define B3__SHIFT 0x03 /* Port 1 Bit 3 Match Value */
#define B3__LOW   0x00 /* P1.3 pin logic value is compared with logic LOW. */
#define B3__HIGH  0x08 /* P1.3 pin logic value is compared with logic HIGH. */

#define B4__BMASK 0x10 /* Port 1 Bit 4 Match Value */
#define B4__SHIFT 0x04 /* Port 1 Bit 4 Match Value */
#define B4__LOW   0x00 /* P1.4 pin logic value is compared with logic LOW. */
#define B4__HIGH  0x10 /* P1.4 pin logic value is compared with logic HIGH. */

#define B5__BMASK 0x20 /* Port 1 Bit 5 Match Value */
#define B5__SHIFT 0x05 /* Port 1 Bit 5 Match Value */
#define B5__LOW   0x00 /* P1.5 pin logic value is compared with logic LOW. */
#define B5__HIGH  0x20 /* P1.5 pin logic value is compared with logic HIGH. */

#define B6__BMASK 0x40 /* Port 1 Bit 6 Match Value */
#define B6__SHIFT 0x06 /* Port 1 Bit 6 Match Value */
#define B6__LOW   0x00 /* P1.6 pin logic value is compared with logic LOW. */
#define B6__HIGH  0x40 /* P1.6 pin logic value is compared with logic HIGH. */

#define B7__BMASK 0x80 /* Port 1 Bit 7 Match Value */
#define B7__SHIFT 0x07 /* Port 1 Bit 7 Match Value */
#define B7__LOW   0x00 /* P1.7 pin logic value is compared with logic LOW. */
#define B7__HIGH  0x80 /* P1.7 pin logic value is compared with logic HIGH. */

/*------------------------------------------------------------------------------ */
/* P1MDIN Enums (Port 1 Input Mode @ 0xF2) */
/*------------------------------------------------------------------------------ */
#define B0__BMASK   0x01 /* Port 1 Bit 0 Input Mode */
#define B0__SHIFT   0x00 /* Port 1 Bit 0 Input Mode */
#define B0__ANALOG  0x00 /* P1.0 pin is configured for analog mode. */
#define B0__DIGITAL 0x01 /* P1.0 pin is configured for digital mode. */

#define B1__BMASK   0x02 /* Port 1 Bit 1 Input Mode */
#define B1__SHIFT   0x01 /* Port 1 Bit 1 Input Mode */
#define B1__ANALOG  0x00 /* P1.1 pin is configured for analog mode. */
#define B1__DIGITAL 0x02 /* P1.1 pin is configured for digital mode. */

#define B2__BMASK   0x04 /* Port 1 Bit 2 Input Mode */
#define B2__SHIFT   0x02 /* Port 1 Bit 2 Input Mode */
#define B2__ANALOG  0x00 /* P1.2 pin is configured for analog mode. */
#define B2__DIGITAL 0x04 /* P1.2 pin is configured for digital mode. */

#define B3__BMASK   0x08 /* Port 1 Bit 3 Input Mode */
#define B3__SHIFT   0x03 /* Port 1 Bit 3 Input Mode */
#define B3__ANALOG  0x00 /* P1.3 pin is configured for analog mode. */
#define B3__DIGITAL 0x08 /* P1.3 pin is configured for digital mode. */

#define B4__BMASK   0x10 /* Port 1 Bit 4 Input Mode */
#define B4__SHIFT   0x04 /* Port 1 Bit 4 Input Mode */
#define B4__ANALOG  0x00 /* P1.4 pin is configured for analog mode. */
#define B4__DIGITAL 0x10 /* P1.4 pin is configured for digital mode. */

#define B5__BMASK   0x20 /* Port 1 Bit 5 Input Mode */
#define B5__SHIFT   0x05 /* Port 1 Bit 5 Input Mode */
#define B5__ANALOG  0x00 /* P1.5 pin is configured for analog mode. */
#define B5__DIGITAL 0x20 /* P1.5 pin is configured for digital mode. */

#define B6__BMASK   0x40 /* Port 1 Bit 6 Input Mode */
#define B6__SHIFT   0x06 /* Port 1 Bit 6 Input Mode */
#define B6__ANALOG  0x00 /* P1.6 pin is configured for analog mode. */
#define B6__DIGITAL 0x40 /* P1.6 pin is configured for digital mode. */

#define B7__BMASK   0x80 /* Port 1 Bit 7 Input Mode */
#define B7__SHIFT   0x07 /* Port 1 Bit 7 Input Mode */
#define B7__ANALOG  0x00 /* P1.7 pin is configured for analog mode. */
#define B7__DIGITAL 0x80 /* P1.7 pin is configured for digital mode. */

/*------------------------------------------------------------------------------ */
/* P1MDOUT Enums (Port 1 Output Mode @ 0xA5)                                     */
/*------------------------------------------------------------------------------ */
#define B0__BMASK      0x01 /* Port 1 Bit 0 Output Mode */
#define B0__SHIFT      0x00 /* Port 1 Bit 0 Output Mode */
#define B0__OPEN_DRAIN 0x00 /* P1.0 output is open-drain. */
#define B0__PUSH_PULL  0x01 /* P1.0 output is push-pull. */

#define B1__BMASK      0x02 /* Port 1 Bit 1 Output Mode */
#define B1__SHIFT      0x01 /* Port 1 Bit 1 Output Mode */
#define B1__OPEN_DRAIN 0x00 /* P1.1 output is open-drain. */
#define B1__PUSH_PULL  0x02 /* P1.1 output is push-pull. */

#define B2__BMASK      0x04 /* Port 1 Bit 2 Output Mode */
#define B2__SHIFT      0x02 /* Port 1 Bit 2 Output Mode */
#define B2__OPEN_DRAIN 0x00 /* P1.2 output is open-drain. */
#define B2__PUSH_PULL  0x04 /* P1.2 output is push-pull. */

#define B3__BMASK      0x08 /* Port 1 Bit 3 Output Mode */
#define B3__SHIFT      0x03 /* Port 1 Bit 3 Output Mode */
#define B3__OPEN_DRAIN 0x00 /* P1.3 output is open-drain. */
#define B3__PUSH_PULL  0x08 /* P1.3 output is push-pull. */

#define B4__BMASK      0x10 /* Port 1 Bit 4 Output Mode */
#define B4__SHIFT      0x04 /* Port 1 Bit 4 Output Mode */
#define B4__OPEN_DRAIN 0x00 /* P1.4 output is open-drain. */
#define B4__PUSH_PULL  0x10 /* P1.4 output is push-pull. */

