OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define B5__BMASK      0x20 /* Port 1 Bit 5 Output Mode */
#define B5__SHIFT      0x05 /* Port 1 Bit 5 Output Mode */
#define B5__OPEN_DRAIN 0x00 /* P1.5 output is open-drain. */
#define B5__PUSH_PULL  0x20 /* P1.5 output is push-pull. */

#define B6__BMASK      0x40 /* Port 1 Bit 6 Output Mode */
#define B6__SHIFT      0x06 /* Port 1 Bit 6 Output Mode */
#define B6__OPEN_DRAIN 0x00 /* P1.6 output is open-drain. */
#define B6__PUSH_PULL  0x40 /* P1.6 output is push-pull. */

#define B7__BMASK      0x80 /* Port 1 Bit 7 Output Mode */
#define B7__SHIFT      0x07 /* Port 1 Bit 7 Output Mode */
#define B7__OPEN_DRAIN 0x00 /* P1.7 output is open-drain. */
#define B7__PUSH_PULL  0x80 /* P1.7 output is push-pull. */

/*------------------------------------------------------------------------------ */
/* P1SKIP Enums (Port 1 Skip @ 0xD5)                                             */
/*------------------------------------------------------------------------------ */
#define B0__BMASK       0x01 /* Port 1 Bit 0 Skip */
#define B0__SHIFT       0x00 /* Port 1 Bit 0 Skip */
#define B0__NOT_SKIPPED 0x00 /* P1.0 pin is not skipped by the crossbar. */
#define B0__SKIPPED     0x01 /* P1.0 pin is skipped by the crossbar. */

#define B1__BMASK       0x02 /* Port 1 Bit 1 Skip */
#define B1__SHIFT       0x01 /* Port 1 Bit 1 Skip */
#define B1__NOT_SKIPPED 0x00 /* P1.1 pin is not skipped by the crossbar. */
#define B1__SKIPPED     0x02 /* P1.1 pin is skipped by the crossbar. */

#define B2__BMASK       0x04 /* Port 1 Bit 2 Skip */
#define B2__SHIFT       0x02 /* Port 1 Bit 2 Skip */
#define B2__NOT_SKIPPED 0x00 /* P1.2 pin is not skipped by the crossbar. */
#define B2__SKIPPED     0x04 /* P1.2 pin is skipped by the crossbar. */

#define B3__BMASK       0x08 /* Port 1 Bit 3 Skip */
#define B3__SHIFT       0x03 /* Port 1 Bit 3 Skip */
#define B3__NOT_SKIPPED 0x00 /* P1.3 pin is not skipped by the crossbar. */
#define B3__SKIPPED     0x08 /* P1.3 pin is skipped by the crossbar. */

#define B4__BMASK       0x10 /* Port 1 Bit 4 Skip */
#define B4__SHIFT       0x04 /* Port 1 Bit 4 Skip */
#define B4__NOT_SKIPPED 0x00 /* P1.4 pin is not skipped by the crossbar. */
#define B4__SKIPPED     0x10 /* P1.4 pin is skipped by the crossbar. */

#define B5__BMASK       0x20 /* Port 1 Bit 5 Skip */
#define B5__SHIFT       0x05 /* Port 1 Bit 5 Skip */
#define B5__NOT_SKIPPED 0x00 /* P1.5 pin is not skipped by the crossbar. */
#define B5__SKIPPED     0x20 /* P1.5 pin is skipped by the crossbar. */

#define B6__BMASK       0x40 /* Port 1 Bit 6 Skip */
#define B6__SHIFT       0x06 /* Port 1 Bit 6 Skip */
#define B6__NOT_SKIPPED 0x00 /* P1.6 pin is not skipped by the crossbar. */
#define B6__SKIPPED     0x40 /* P1.6 pin is skipped by the crossbar. */

#define B7__BMASK       0x80 /* Port 1 Bit 7 Skip */
#define B7__SHIFT       0x07 /* Port 1 Bit 7 Skip */
#define B7__NOT_SKIPPED 0x00 /* P1.7 pin is not skipped by the crossbar. */
#define B7__SKIPPED     0x80 /* P1.7 pin is skipped by the crossbar. */

/*------------------------------------------------------------------------------ */
/* P2 Enums (Port 2 Pin Latch @ 0xA0)                                            */
/*------------------------------------------------------------------------------ */
#define B0__BMASK 0x01 /* Port 2 Bit 0 Latch */
#define B0__SHIFT 0x00 /* Port 2 Bit 0 Latch */
#define B0__LOW   0x00 /* P2.0 is low. Set P2.0 to drive low. */
#define B0__HIGH  0x01 /* P2.0 is high. Set P2.0 to drive or float high. */

#define B1__BMASK 0x02 /* Port 2 Bit 1 Latch */
#define B1__SHIFT 0x01 /* Port 2 Bit 1 Latch */
#define B1__LOW   0x00 /* P2.1 is low. Set P2.1 to drive low. */
#define B1__HIGH  0x02 /* P2.1 is high. Set P2.1 to drive or float high. */

/*------------------------------------------------------------------------------ */
/* P2MDOUT Enums (Port 2 Output Mode @ 0xA6)                                     */
/*------------------------------------------------------------------------------ */
#define B0__BMASK      0x01 /* Port 2 Bit 0 Output Mode */
#define B0__SHIFT      0x00 /* Port 2 Bit 0 Output Mode */
#define B0__OPEN_DRAIN 0x00 /* P2.0 output is open-drain. */
#define B0__PUSH_PULL  0x01 /* P2.0 output is push-pull. */

#define B1__BMASK      0x02 /* Port 2 Bit 1 Output Mode */
#define B1__SHIFT      0x01 /* Port 2 Bit 1 Output Mode */
#define B1__OPEN_DRAIN 0x00 /* P2.1 output is open-drain. */
#define B1__PUSH_PULL  0x02 /* P2.1 output is push-pull. */

/*------------------------------------------------------------------------------ */
/* XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)                                       */
/*------------------------------------------------------------------------------ */
#define URT0E__BMASK     0x01 /* UART I/O Output Enable */
#define URT0E__SHIFT     0x00 /* UART I/O Output Enable */
#define URT0E__DISABLED  0x00 /* UART I/O unavailable at Port pin. */
#define URT0E__ENABLED   0x01 /* UART TX, RX routed to Port pins P0.4 and P0.5. */

#define SPI0E__BMASK     0x02 /* SPI I/O Enable */
#define SPI0E__SHIFT     0x01 /* SPI I/O Enable */
#define SPI0E__DISABLED  0x00 /* SPI I/O unavailable at Port pins. */
#define SPI0E__ENABLED   0x02 /* SPI I/O routed to Port pins. The SPI can be assigned either 3 or 4 GPIO pins. */

#define SMB0E__BMASK     0x04 /* SMB0 I/O Enable */
#define SMB0E__SHIFT     0x02 /* SMB0 I/O Enable */
#define SMB0E__DISABLED  0x00 /* SMBus 0 I/O unavailable at Port pins. */
#define SMB0E__ENABLED   0x04 /* SMBus 0 I/O routed to Port pins. */

#define CP0E__BMASK      0x08 /* Comparator0 Output Enable */
#define CP0E__SHIFT      0x03 /* Comparator0 Output Enable */
#define CP0E__DISABLED   0x00 /* CP0 unavailable at Port pin. */
#define CP0E__ENABLED    0x08 /* CP0 routed to Port pin. */

#define CP0AE__BMASK     0x10 /* Comparator0 Asynchronous Output Enable */
#define CP0AE__SHIFT     0x04 /* Comparator0 Asynchronous Output Enable */
#define CP0AE__DISABLED  0x00 /* Asynchronous CP0 unavailable at Port pin. */
#define CP0AE__ENABLED   0x10 /* Asynchronous CP0 routed to Port pin. */

#define CP1E__BMASK      0x20 /* Comparator1 Output Enable */
#define CP1E__SHIFT      0x05 /* Comparator1 Output Enable */
#define CP1E__DISABLED   0x00 /* CP1 unavailable at Port pin. */
#define CP1E__ENABLED    0x20 /* CP1 routed to Port pin. */

