OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define CP1AE__BMASK     0x40 /* Comparator1 Asynchronous Output Enable */
#define CP1AE__SHIFT     0x06 /* Comparator1 Asynchronous Output Enable */
#define CP1AE__DISABLED  0x00 /* Asynchronous CP1 unavailable at Port pin. */
#define CP1AE__ENABLED   0x40 /* Asynchronous CP1 routed to Port pin. */

#define SYSCKE__BMASK    0x80 /* SYSCLK Output Enable */
#define SYSCKE__SHIFT    0x07 /* SYSCLK Output Enable */
#define SYSCKE__DISABLED 0x00 /* SYSCLK unavailable at Port pin. */
#define SYSCKE__ENABLED  0x80 /* SYSCLK output routed to Port pin. */

/*------------------------------------------------------------------------------ */
/* XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)                                       */
/*------------------------------------------------------------------------------ */
#define PCA0ME__FMASK          0x03 /* PCA Module I/O Enable */
#define PCA0ME__SHIFT          0x00 /* PCA Module I/O Enable */
#define PCA0ME__DISABLED       0x00 /* All PCA I/O unavailable at Port pins. */
#define PCA0ME__CEX0           0x01 /* CEX0 routed to Port pin. */
#define PCA0ME__CEX0_CEX1      0x02 /* CEX0, CEX1 routed to Port pins. */
#define PCA0ME__CEX0_CEX1_CEX2 0x03 /* CEX0, CEX1, CEX2 routed to Port pins. */

#define ECIE__BMASK            0x04 /* PCA0 External Counter Input Enable */
#define ECIE__SHIFT            0x02 /* PCA0 External Counter Input Enable */
#define ECIE__DISABLED         0x00 /* ECI unavailable at Port pin. */
#define ECIE__ENABLED          0x04 /* ECI routed to Port pin. */

#define T0E__BMASK             0x08 /* T0 Enable */
#define T0E__SHIFT             0x03 /* T0 Enable */
#define T0E__DISABLED          0x00 /* T0 unavailable at Port pin. */
#define T0E__ENABLED           0x08 /* T0 routed to Port pin. */

#define T1E__BMASK             0x10 /* T1 Enable */
#define T1E__SHIFT             0x04 /* T1 Enable */
#define T1E__DISABLED          0x00 /* T1 unavailable at Port pin. */
#define T1E__ENABLED           0x10 /* T1 routed to Port pin. */

#define T2E__BMASK             0x20 /* T2 Enable */
#define T2E__SHIFT             0x05 /* T2 Enable */
#define T2E__DISABLED          0x00 /* T2 unavailable at Port pin. */
#define T2E__ENABLED           0x20 /* T2 routed to Port pin. */

/*------------------------------------------------------------------------------ */
/* XBR2 Enums (Port I/O Crossbar 2 @ 0xE3)                                       */
/*------------------------------------------------------------------------------ */
#define XBARE__BMASK               0x40 /* Crossbar Enable */
#define XBARE__SHIFT               0x06 /* Crossbar Enable */
#define XBARE__DISABLED            0x00 /* Crossbar disabled. */
#define XBARE__ENABLED             0x40 /* Crossbar enabled. */

#define WEAKPUD__BMASK             0x80 /* Port I/O Weak Pullup Disable */
#define WEAKPUD__SHIFT             0x07 /* Port I/O Weak Pullup Disable */
#define WEAKPUD__PULL_UPS_ENABLED  0x00 /* Weak Pullups enabled (except for Ports whose I/O are configured for analog mode). */
#define WEAKPUD__PULL_UPS_DISABLED 0x80 /* Weak Pullups disabled. */

/*------------------------------------------------------------------------------ */
/* ADC0CN1 Enums (ADC0 Control 1 @ 0xB2)                                         */
/*------------------------------------------------------------------------------ */
#define ADCMBE__BMASK              0x01 /* Common Mode Buffer Enable */
#define ADCMBE__SHIFT              0x00 /* Common Mode Buffer Enable */
#define ADCMBE__CM_BUFFER_DISABLED 0x00 /* Disable the common mode buffer. This setting should be used only if the tracking time of the signal is greater than 1.5 us. */
#define ADCMBE__CM_BUFFER_ENABLED  0x01 /* Enable the common mode buffer. This setting should be used in most cases, and will give the best dynamic ADC performance. The common mode buffer must be enabled if signal tracking time is less than or equal to 1.5 us. */

/*------------------------------------------------------------------------------ */
/* ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)                            */
/*------------------------------------------------------------------------------ */
#define ADC0GTH__FMASK 0xFF /* Greater-Than High Byte */
#define ADC0GTH__SHIFT 0x00 /* Greater-Than High Byte */

/*------------------------------------------------------------------------------ */
/* ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)                             */
/*------------------------------------------------------------------------------ */
#define ADC0GTL__FMASK 0xFF /* Greater-Than Low Byte */
#define ADC0GTL__SHIFT 0x00 /* Greater-Than Low Byte */

/*------------------------------------------------------------------------------ */
/* ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)                                 */
/*------------------------------------------------------------------------------ */
#define ADC0H__FMASK 0xFF /* Data Word High Byte */
#define ADC0H__SHIFT 0x00 /* Data Word High Byte */

/*------------------------------------------------------------------------------ */
/* ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)                                  */
/*------------------------------------------------------------------------------ */
#define ADC0L__FMASK 0xFF /* Data Word Low Byte */
#define ADC0L__SHIFT 0x00 /* Data Word Low Byte */

/*------------------------------------------------------------------------------ */
/* ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)                               */
/*------------------------------------------------------------------------------ */
#define ADC0LTH__FMASK 0xFF /* Less-Than High Byte */
#define ADC0LTH__SHIFT 0x00 /* Less-Than High Byte */

/*------------------------------------------------------------------------------ */
/* ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)                                */
/*------------------------------------------------------------------------------ */
#define ADC0LTL__FMASK 0xFF /* Less-Than Low Byte */
#define ADC0LTL__SHIFT 0x00 /* Less-Than Low Byte */

