OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*------------------------------------------------------------------------------ */
/* ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)                              */
/*------------------------------------------------------------------------------ */
#define ADC0MX__FMASK   0x1F /* AMUX0 Positive Input Selection */
#define ADC0MX__SHIFT   0x00 /* AMUX0 Positive Input Selection */
#define ADC0MX__ADC0P0  0x00 /* Select ADC0.0. */
#define ADC0MX__ADC0P1  0x01 /* Select ADC0.1. */
#define ADC0MX__ADC0P2  0x02 /* Select ADC0.2. */
#define ADC0MX__ADC0P3  0x03 /* Select ADC0.3. */
#define ADC0MX__ADC0P4  0x04 /* Select ADC0.4. */
#define ADC0MX__ADC0P5  0x05 /* Select ADC0.5. */
#define ADC0MX__ADC0P6  0x06 /* Select ADC0.6. */
#define ADC0MX__ADC0P7  0x07 /* Select ADC0.7. */
#define ADC0MX__ADC0P8  0x08 /* Select ADC0.8. */
#define ADC0MX__ADC0P9  0x09 /* Select ADC0.9. */
#define ADC0MX__ADC0P10 0x0A /* Select ADC0.10. */
#define ADC0MX__ADC0P11 0x0B /* Select ADC0.11. */
#define ADC0MX__ADC0P12 0x0C /* Select ADC0.12. */
#define ADC0MX__ADC0P13 0x0D /* Select ADC0.13. */
#define ADC0MX__ADC0P14 0x0E /* Select ADC0.14. */
#define ADC0MX__ADC0P15 0x0F /* Select ADC0.15. */
#define ADC0MX__TEMP    0x10 /* Select ADC0.16. */
#define ADC0MX__LDO_OUT 0x11 /* Select ADC0.17. */
#define ADC0MX__VDD     0x12 /* Select ADC0.18. */
#define ADC0MX__GND     0x13 /* Select ADC0.19. */
#define ADC0MX__NONE    0x1F /* No input selected. */

/*------------------------------------------------------------------------------ */
/* ADC0PWR Enums (ADC0 Power Control @ 0xDF)                                     */
/*------------------------------------------------------------------------------ */
#define ADPWR__FMASK                 0x0F /* Burst Mode Power Up Time */
#define ADPWR__SHIFT                 0x00 /* Burst Mode Power Up Time */

#define ADLPM__BMASK                 0x10 /* Low Power Mode Enable */
#define ADLPM__SHIFT                 0x04 /* Low Power Mode Enable */
#define ADLPM__LP_BUFFER_DISABLED    0x00 /* Disable low power mode. */
#define ADLPM__LP_BUFFER_ENABLED     0x10 /* Enable low power mode (requires extended tracking time). */

#define ADMXLP__BMASK                0x20 /* Mux and Reference Low Power Mode Enable */
#define ADMXLP__SHIFT                0x05 /* Mux and Reference Low Power Mode Enable */
#define ADMXLP__LP_MUX_VREF_DISABLED 0x00 /* Low power mode disabled. */
#define ADMXLP__LP_MUX_VREF_ENABLED  0x20 /* Low power mode enabled (SAR clock < 4 MHz). */

#define ADBIAS__FMASK                0xC0 /* Bias Power Select */
#define ADBIAS__SHIFT                0x06 /* Bias Power Select */
#define ADBIAS__MODE0                0x00 /* Select bias current mode 0. Recommended to use modes 1, 2, or 3. */
#define ADBIAS__MODE1                0x40 /* Select bias current mode 1 (SARCLK <= 16 MHz). */
#define ADBIAS__MODE2                0x80 /* Select bias current mode 2. */
#define ADBIAS__MODE3                0xC0 /* Select bias current mode 3 (SARCLK <= 4 MHz). */

/*------------------------------------------------------------------------------ */
/* ADC0TK Enums (ADC0 Burst Mode Track Time @ 0xB9)                              */
/*------------------------------------------------------------------------------ */
#define ADTK__FMASK         0x3F /* Burst Mode Tracking Time */
#define ADTK__SHIFT         0x00 /* Burst Mode Tracking Time */

#define AD12SM__BMASK       0x80 /* 12-Bit Sampling Mode */
#define AD12SM__SHIFT       0x07 /* 12-Bit Sampling Mode */
#define AD12SM__SAMPLE_FOUR 0x00 /* The ADC will re-track and sample the input four times during a 12-bit conversion. */
#define AD12SM__SAMPLE_ONCE 0x80 /* The ADC will sample the input once at the beginning of each 12-bit conversion. The ADTK field can be set to 63 to maximize throughput. */

/*------------------------------------------------------------------------------ */
/* REF0CN Enums (Voltage Reference Control @ 0xD1)                               */
/*------------------------------------------------------------------------------ */
#define TEMPE__BMASK         0x04 /* Temperature Sensor Enable */
#define TEMPE__SHIFT         0x02 /* Temperature Sensor Enable */
#define TEMPE__TEMP_DISABLED 0x00 /* Disable the Temperature Sensor. */
#define TEMPE__TEMP_ENABLED  0x04 /* Enable the Temperature Sensor. */

#define REFSL__FMASK         0x18 /* Voltage Reference Select */
#define REFSL__SHIFT         0x03 /* Voltage Reference Select */
#define REFSL__VREF_PIN      0x00 /* The ADC0 voltage reference is the P0.0/VREF pin. */
#define REFSL__VDD_PIN       0x08 /* The ADC0 voltage reference is the VDD pin. */
#define REFSL__INTERNAL_LDO  0x10 /* The ADC0 voltage reference is the internal 1.8 V digital supply voltage. */
#define REFSL__INTERNAL_VREF 0x18 /* The ADC0 voltage reference is the internal voltage reference. */

#define GNDSL__BMASK         0x20 /* Analog Ground Reference */
#define GNDSL__SHIFT         0x05 /* Analog Ground Reference */
#define GNDSL__GND_PIN       0x00 /* The ADC0 ground reference is the GND pin. */
#define GNDSL__AGND_PIN      0x20 /* The ADC0 ground reference is the P0.1/AGND pin. */

#define IREFLVL__BMASK       0x80 /* Internal Voltage Reference Level */
#define IREFLVL__SHIFT       0x07 /* Internal Voltage Reference Level */
#define IREFLVL__1P65        0x00 /* The internal reference operates at 1.65 V nominal. */
#define IREFLVL__2P4         0x80 /* The internal reference operates at 2.4 V nominal. */

/*------------------------------------------------------------------------------ */
/* REG0CN Enums (Voltage Regulator 0 Control @ 0xC9)                             */
/*------------------------------------------------------------------------------ */
#define STOPCF__BMASK    0x08 /* Stop Mode Configuration */
#define STOPCF__SHIFT    0x03 /* Stop Mode Configuration */
#define STOPCF__ACTIVE   0x00 /* Regulator is still active in stop mode. Any enabled reset source will reset the device. */
#define STOPCF__SHUTDOWN 0x08 /* Regulator is shut down in stop mode. Only the RSTb pin or power cycle can reset the device. */

