OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*------------------------------------------------------------------------------ */
/* CLKSEL Enums (Clock Select @ 0xA9)                                            */
/*------------------------------------------------------------------------------ */
#define CLKSL__FMASK           0x03 /* Clock Source Select */
#define CLKSL__SHIFT           0x00 /* Clock Source Select */
#define CLKSL__HFOSC           0x00 /* Clock derived from the Internal High-Frequency Oscillator. */
#define CLKSL__EXTOSC          0x01 /* Clock derived from the External CMOS clock circuit. */
#define CLKSL__LFOSC           0x02 /* Clock derived from the Internal Low-Frequency Oscillator. */

#define CLKDIV__FMASK          0x70 /* Clock Source Divider */
#define CLKDIV__SHIFT          0x04 /* Clock Source Divider */
#define CLKDIV__SYSCLK_DIV_1   0x00 /* SYSCLK is equal to selected clock source divided by 1. */
#define CLKDIV__SYSCLK_DIV_2   0x10 /* SYSCLK is equal to selected clock source divided by 2. */
#define CLKDIV__SYSCLK_DIV_4   0x20 /* SYSCLK is equal to selected clock source divided by 4. */
#define CLKDIV__SYSCLK_DIV_8   0x30 /* SYSCLK is equal to selected clock source divided by 8. */
#define CLKDIV__SYSCLK_DIV_16  0x40 /* SYSCLK is equal to selected clock source divided by 16. */
#define CLKDIV__SYSCLK_DIV_32  0x50 /* SYSCLK is equal to selected clock source divided by 32. */
#define CLKDIV__SYSCLK_DIV_64  0x60 /* SYSCLK is equal to selected clock source divided by 64. */
#define CLKDIV__SYSCLK_DIV_128 0x70 /* SYSCLK is equal to selected clock source divided by 128. */

/*------------------------------------------------------------------------------ */
/* TMR2CN0 Enums (Timer 2 Control 0 @ 0xC8)                                      */
/*------------------------------------------------------------------------------ */
#define T2XCLK__BMASK          0x01 /* Timer 2 External Clock Select */
#define T2XCLK__SHIFT          0x00 /* Timer 2 External Clock Select */
#define T2XCLK__SYSCLK_DIV_12  0x00 /* Timer 2 clock is the system clock divided by 12. */
#define T2XCLK__EXTOSC_DIV_8   0x01 /* Timer 2 clock is the external oscillator divided by 8 (synchronized with SYSCLK). */

#define TR2__BMASK             0x04 /* Timer 2 Run Control */
#define TR2__SHIFT             0x02 /* Timer 2 Run Control */
#define TR2__STOP              0x00 /* Stop Timer 2. */
#define TR2__RUN               0x04 /* Start Timer 2 running. */

#define T2SPLIT__BMASK         0x08 /* Timer 2 Split Mode Enable */
#define T2SPLIT__SHIFT         0x03 /* Timer 2 Split Mode Enable */
#define T2SPLIT__16_BIT_RELOAD 0x00 /* Timer 2 operates in 16-bit auto-reload mode. */
#define T2SPLIT__8_BIT_RELOAD  0x08 /* Timer 2 operates as two 8-bit auto-reload timers. */

#define TF2CEN__BMASK          0x10 /* Timer 2 Capture Enable */
#define TF2CEN__SHIFT          0x04 /* Timer 2 Capture Enable */
#define TF2CEN__DISABLED       0x00 /* Disable capture mode. */
#define TF2CEN__ENABLED        0x10 /* Enable capture mode. */

#define TF2LEN__BMASK          0x20 /* Timer 2 Low Byte Interrupt Enable */
#define TF2LEN__SHIFT          0x05 /* Timer 2 Low Byte Interrupt Enable */
#define TF2LEN__DISABLED       0x00 /* Disable low byte interrupts. */
#define TF2LEN__ENABLED        0x20 /* Enable low byte interrupts. */

#define TF2L__BMASK            0x40 /* Timer 2 Low Byte Overflow Flag */
#define TF2L__SHIFT            0x06 /* Timer 2 Low Byte Overflow Flag */
#define TF2L__NOT_SET          0x00 /* Timer 2 low byte did not overflow. */
#define TF2L__SET              0x40 /* Timer 2 low byte overflowed. */

#define TF2H__BMASK            0x80 /* Timer 2 High Byte Overflow Flag */
#define TF2H__SHIFT            0x07 /* Timer 2 High Byte Overflow Flag */
#define TF2H__NOT_SET          0x00 /* Timer 2 8-bit high byte or 16-bit value did not overflow. */
#define TF2H__SET              0x80 /* Timer 2 8-bit high byte or 16-bit value overflowed. */

/*------------------------------------------------------------------------------ */
/* TMR3CN0 Enums (Timer 3 Control 0 @ 0x91)                                      */
/*------------------------------------------------------------------------------ */
#define T3XCLK__BMASK          0x01 /* Timer 3 External Clock Select */
#define T3XCLK__SHIFT          0x00 /* Timer 3 External Clock Select */
#define T3XCLK__SYSCLK_DIV_12  0x00 /* Timer 3 clock is the system clock divided by 12. */
#define T3XCLK__EXTOSC_DIV_8   0x01 /* Timer 3 clock is the external oscillator divided by 8 (synchronized with SYSCLK). */

#define TR3__BMASK             0x04 /* Timer 3 Run Control */
#define TR3__SHIFT             0x02 /* Timer 3 Run Control */
#define TR3__STOP              0x00 /* Stop Timer 3. */
#define TR3__RUN               0x04 /* Start Timer 3 running. */

#define T3SPLIT__BMASK         0x08 /* Timer 3 Split Mode Enable */
#define T3SPLIT__SHIFT         0x03 /* Timer 3 Split Mode Enable */
#define T3SPLIT__16_BIT_RELOAD 0x00 /* Timer 3 operates in 16-bit auto-reload mode. */
#define T3SPLIT__8_BIT_RELOAD  0x08 /* Timer 3 operates as two 8-bit auto-reload timers. */

#define TF3CEN__BMASK          0x10 /* Timer 3 Capture Enable */
#define TF3CEN__SHIFT          0x04 /* Timer 3 Capture Enable */
#define TF3CEN__DISABLED       0x00 /* Disable capture mode. */
#define TF3CEN__ENABLED        0x10 /* Enable capture mode. */

#define TF3LEN__BMASK          0x20 /* Timer 3 Low Byte Interrupt Enable */
#define TF3LEN__SHIFT          0x05 /* Timer 3 Low Byte Interrupt Enable */
#define TF3LEN__DISABLED       0x00 /* Disable low byte interrupts. */
#define TF3LEN__ENABLED        0x20 /* Enable low byte interrupts. */

#define TF3L__BMASK            0x40 /* Timer 3 Low Byte Overflow Flag */
#define TF3L__SHIFT            0x06 /* Timer 3 Low Byte Overflow Flag */
#define TF3L__NOT_SET          0x00 /* Timer 3 low byte did not overflow. */
#define TF3L__SET              0x40 /* Timer 3 low byte overflowed. */

#define TF3H__BMASK            0x80 /* Timer 3 High Byte Overflow Flag */
#define TF3H__SHIFT            0x07 /* Timer 3 High Byte Overflow Flag */
#define TF3H__NOT_SET          0x00 /* Timer 3 8-bit high byte or 16-bit value did not overflow. */
#define TF3H__SET              0x80 /* Timer 3 8-bit high byte or 16-bit value overflowed. */

