OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*------------------------------------------------------------------------------ */
/* PCA0CPM0 Enums (PCA Channel 0 Capture/Compare Mode @ 0xDA) */
/*------------------------------------------------------------------------------ */
#define ECCF__BMASK    0x01 /* Channel 0 Capture/Compare Flag Interrupt Enable */
#define ECCF__SHIFT    0x00 /* Channel 0 Capture/Compare Flag Interrupt Enable */
#define ECCF__DISABLED 0x00 /* Disable CCF0 interrupts. */
#define ECCF__ENABLED  0x01 /* Enable a Capture/Compare Flag interrupt request when CCF0 is set. */

#define PWM__BMASK     0x02 /* Channel 0 Pulse Width Modulation Mode Enable */
#define PWM__SHIFT     0x01 /* Channel 0 Pulse Width Modulation Mode Enable */
#define PWM__DISABLED  0x00 /* Disable PWM function. */
#define PWM__ENABLED   0x02 /* Enable PWM function. */

#define TOG__BMASK     0x04 /* Channel 0 Toggle Function Enable */
#define TOG__SHIFT     0x02 /* Channel 0 Toggle Function Enable */
#define TOG__DISABLED  0x00 /* Disable toggle function. */
#define TOG__ENABLED   0x04 /* Enable toggle function. */

#define MAT__BMASK     0x08 /* Channel 0 Match Function Enable */
#define MAT__SHIFT     0x03 /* Channel 0 Match Function Enable */
#define MAT__DISABLED  0x00 /* Disable match function. */
#define MAT__ENABLED   0x08 /* Enable match function. */

#define CAPN__BMASK    0x10 /* Channel 0 Capture Negative Function Enable */
#define CAPN__SHIFT    0x04 /* Channel 0 Capture Negative Function Enable */
#define CAPN__DISABLED 0x00 /* Disable negative edge capture. */
#define CAPN__ENABLED  0x10 /* Enable negative edge capture. */

#define CAPP__BMASK    0x20 /* Channel 0 Capture Positive Function Enable */
#define CAPP__SHIFT    0x05 /* Channel 0 Capture Positive Function Enable */
#define CAPP__DISABLED 0x00 /* Disable positive edge capture. */
#define CAPP__ENABLED  0x20 /* Enable positive edge capture. */

#define ECOM__BMASK    0x40 /* Channel 0 Comparator Function Enable */
#define ECOM__SHIFT    0x06 /* Channel 0 Comparator Function Enable */
#define ECOM__DISABLED 0x00 /* Disable comparator function. */
#define ECOM__ENABLED  0x40 /* Enable comparator function. */

#define PWM16__BMASK   0x80 /* Channel 0 16-bit Pulse Width Modulation Enable */
#define PWM16__SHIFT   0x07 /* Channel 0 16-bit Pulse Width Modulation Enable */
#define PWM16__8_BIT   0x00 /* 8 to 11-bit PWM selected. */
#define PWM16__16_BIT  0x80 /* 16-bit PWM selected. */

/*------------------------------------------------------------------------------ */
/* PCA0CPM1 Enums (PCA Channel 1 Capture/Compare Mode @ 0xDB)                    */
/*------------------------------------------------------------------------------ */
#define ECCF__BMASK    0x01 /* Channel 1 Capture/Compare Flag Interrupt Enable */
#define ECCF__SHIFT    0x00 /* Channel 1 Capture/Compare Flag Interrupt Enable */
#define ECCF__DISABLED 0x00 /* Disable CCF1 interrupts. */
#define ECCF__ENABLED  0x01 /* Enable a Capture/Compare Flag interrupt request when CCF1 is set. */

#define PWM__BMASK     0x02 /* Channel 1 Pulse Width Modulation Mode Enable */
#define PWM__SHIFT     0x01 /* Channel 1 Pulse Width Modulation Mode Enable */
#define PWM__DISABLED  0x00 /* Disable PWM function. */
#define PWM__ENABLED   0x02 /* Enable PWM function. */

#define TOG__BMASK     0x04 /* Channel 1 Toggle Function Enable */
#define TOG__SHIFT     0x02 /* Channel 1 Toggle Function Enable */
#define TOG__DISABLED  0x00 /* Disable toggle function. */
#define TOG__ENABLED   0x04 /* Enable toggle function. */

#define MAT__BMASK     0x08 /* Channel 1 Match Function Enable */
#define MAT__SHIFT     0x03 /* Channel 1 Match Function Enable */
#define MAT__DISABLED  0x00 /* Disable match function. */
#define MAT__ENABLED   0x08 /* Enable match function. */

#define CAPN__BMASK    0x10 /* Channel 1 Capture Negative Function Enable */
#define CAPN__SHIFT    0x04 /* Channel 1 Capture Negative Function Enable */
#define CAPN__DISABLED 0x00 /* Disable negative edge capture. */
#define CAPN__ENABLED  0x10 /* Enable negative edge capture. */

#define CAPP__BMASK    0x20 /* Channel 1 Capture Positive Function Enable */
#define CAPP__SHIFT    0x05 /* Channel 1 Capture Positive Function Enable */
#define CAPP__DISABLED 0x00 /* Disable positive edge capture. */
#define CAPP__ENABLED  0x20 /* Enable positive edge capture. */

#define ECOM__BMASK    0x40 /* Channel 1 Comparator Function Enable */
#define ECOM__SHIFT    0x06 /* Channel 1 Comparator Function Enable */
#define ECOM__DISABLED 0x00 /* Disable comparator function. */
#define ECOM__ENABLED  0x40 /* Enable comparator function. */

#define PWM16__BMASK   0x80 /* Channel 1 16-bit Pulse Width Modulation Enable */
#define PWM16__SHIFT   0x07 /* Channel 1 16-bit Pulse Width Modulation Enable */
#define PWM16__8_BIT   0x00 /* 8 to 11-bit PWM selected. */
#define PWM16__16_BIT  0x80 /* 16-bit PWM selected. */

/*------------------------------------------------------------------------------ */
/* PCA0CPM2 Enums (PCA Channel 2 Capture/Compare Mode @ 0xDC)                    */
/*------------------------------------------------------------------------------ */
#define ECCF__BMASK    0x01 /* Channel 2 Capture/Compare Flag Interrupt Enable */
#define ECCF__SHIFT    0x00 /* Channel 2 Capture/Compare Flag Interrupt Enable */
#define ECCF__DISABLED 0x00 /* Disable CCF2 interrupts. */
#define ECCF__ENABLED  0x01 /* Enable a Capture/Compare Flag interrupt request */
/* when CCF2 is set. */

#define PWM__BMASK     0x02 /* Channel 2 Pulse Width Modulation Mode Enable */
#define PWM__SHIFT     0x01 /* Channel 2 Pulse Width Modulation Mode Enable */
#define PWM__DISABLED  0x00 /* Disable PWM function. */
#define PWM__ENABLED   0x02 /* Enable PWM function. */

#define TOG__BMASK     0x04 /* Channel 2 Toggle Function Enable */
#define TOG__SHIFT     0x02 /* Channel 2 Toggle Function Enable */
#define TOG__DISABLED  0x00 /* Disable toggle function. */
#define TOG__ENABLED   0x04 /* Enable toggle function. */

