OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define MAT__BMASK     0x08 /* Channel 2 Match Function Enable */
#define MAT__SHIFT     0x03 /* Channel 2 Match Function Enable */
#define MAT__DISABLED  0x00 /* Disable match function. */
#define MAT__ENABLED   0x08 /* Enable match function. */

#define CAPN__BMASK    0x10 /* Channel 2 Capture Negative Function Enable */
#define CAPN__SHIFT    0x04 /* Channel 2 Capture Negative Function Enable */
#define CAPN__DISABLED 0x00 /* Disable negative edge capture. */
#define CAPN__ENABLED  0x10 /* Enable negative edge capture. */

#define CAPP__BMASK    0x20 /* Channel 2 Capture Positive Function Enable */
#define CAPP__SHIFT    0x05 /* Channel 2 Capture Positive Function Enable */
#define CAPP__DISABLED 0x00 /* Disable positive edge capture. */
#define CAPP__ENABLED  0x20 /* Enable positive edge capture. */

#define ECOM__BMASK    0x40 /* Channel 2 Comparator Function Enable */
#define ECOM__SHIFT    0x06 /* Channel 2 Comparator Function Enable */
#define ECOM__DISABLED 0x00 /* Disable comparator function. */
#define ECOM__ENABLED  0x40 /* Enable comparator function. */

#define PWM16__BMASK   0x80 /* Channel 2 16-bit Pulse Width Modulation Enable */
#define PWM16__SHIFT   0x07 /* Channel 2 16-bit Pulse Width Modulation Enable */
#define PWM16__8_BIT   0x00 /* 8 to 11-bit PWM selected. */
#define PWM16__16_BIT  0x80 /* 16-bit PWM selected. */

/*------------------------------------------------------------------------------ */
/* PCA0CENT Enums (PCA Center Alignment Enable @ 0x9E)                           */
/*------------------------------------------------------------------------------ */
#define CEX0CEN__BMASK  0x01 /* CEX0 Center Alignment Enable */
#define CEX0CEN__SHIFT  0x00 /* CEX0 Center Alignment Enable */
#define CEX0CEN__EDGE   0x00 /* Edge-aligned. */
#define CEX0CEN__CENTER 0x01 /* Center-aligned. */

#define CEX1CEN__BMASK  0x02 /* CEX1 Center Alignment Enable */
#define CEX1CEN__SHIFT  0x01 /* CEX1 Center Alignment Enable */
#define CEX1CEN__EDGE   0x00 /* Edge-aligned. */
#define CEX1CEN__CENTER 0x02 /* Center-aligned. */

#define CEX2CEN__BMASK  0x04 /* CEX2 Center Alignment Enable */
#define CEX2CEN__SHIFT  0x02 /* CEX2 Center Alignment Enable */
#define CEX2CEN__EDGE   0x00 /* Edge-aligned. */
#define CEX2CEN__CENTER 0x04 /* Center-aligned. */

/*------------------------------------------------------------------------------ */
/* PCA0CLR Enums (PCA Comparator Clear Control @ 0x9C)                           */
/*------------------------------------------------------------------------------ */
#define CPCE0__BMASK    0x01 /* Comparator Clear Enable for CEX0 */
#define CPCE0__SHIFT    0x00 /* Comparator Clear Enable for CEX0 */
#define CPCE0__DISABLED 0x00 /* Disable the comparator clear function on PCA channel 0. */
#define CPCE0__ENABLED  0x01 /* Enable the comparator clear function on PCA channel 0. */

#define CPCE1__BMASK    0x02 /* Comparator Clear Enable for CEX1 */
#define CPCE1__SHIFT    0x01 /* Comparator Clear Enable for CEX1 */
#define CPCE1__DISABLED 0x00 /* Disable the comparator clear function on PCA channel 1. */
#define CPCE1__ENABLED  0x02 /* Enable the comparator clear function on PCA channel 1. */

#define CPCE2__BMASK    0x04 /* Comparator Clear Enable for CEX2 */
#define CPCE2__SHIFT    0x02 /* Comparator Clear Enable for CEX2 */
#define CPCE2__DISABLED 0x00 /* Disable the comparator clear function on PCA channel 2. */
#define CPCE2__ENABLED  0x04 /* Enable the comparator clear function on PCA channel 2. */

#define CPCPOL__BMASK   0x80 /* Comparator Clear Polarity */
#define CPCPOL__SHIFT   0x07 /* Comparator Clear Polarity */
#define CPCPOL__LOW     0x00 /* PCA channel(s) will be cleared when comparator result goes logic low. */
#define CPCPOL__HIGH    0x80 /* PCA channel(s) will be cleared when comparator result goes logic high. */

/*------------------------------------------------------------------------------ */
/* PCA0CN0 Enums (PCA Control @ 0xD8)                                            */
/*------------------------------------------------------------------------------ */
#define CCF0__BMASK   0x01 /* PCA Module 0 Capture/Compare Flag */
#define CCF0__SHIFT   0x00 /* PCA Module 0 Capture/Compare Flag */
#define CCF0__NOT_SET 0x00 /* A match or capture did not occur on channel 0. */
#define CCF0__SET     0x01 /* A match or capture occurred on channel 0. */

#define CCF1__BMASK   0x02 /* PCA Module 1 Capture/Compare Flag */
#define CCF1__SHIFT   0x01 /* PCA Module 1 Capture/Compare Flag */
#define CCF1__NOT_SET 0x00 /* A match or capture did not occur on channel 1. */
#define CCF1__SET     0x02 /* A match or capture occurred on channel 1. */

#define CCF2__BMASK   0x04 /* PCA Module 2 Capture/Compare Flag */
#define CCF2__SHIFT   0x02 /* PCA Module 2 Capture/Compare Flag */
#define CCF2__NOT_SET 0x00 /* A match or capture did not occur on channel 2. */
#define CCF2__SET     0x04 /* A match or capture occurred on channel 2. */

#define CR__BMASK     0x40 /* PCA Counter/Timer Run Control */
#define CR__SHIFT     0x06 /* PCA Counter/Timer Run Control */
#define CR__STOP      0x00 /* Stop the PCA Counter/Timer. */
#define CR__RUN       0x40 /* Start the PCA Counter/Timer running. */

#define CF__BMASK     0x80 /* PCA Counter/Timer Overflow Flag */
#define CF__SHIFT     0x07 /* PCA Counter/Timer Overflow Flag */
#define CF__NOT_SET   0x00 /* The PCA counter/timer did not overflow. */
#define CF__SET       0x80 /* The PCA counter/timer overflowed. */

/*------------------------------------------------------------------------------ */
/* PCA0MD Enums (PCA Mode @ 0xD9)                                                */
/*------------------------------------------------------------------------------ */
#define ECF__BMASK            0x01 /* PCA Counter/Timer Overflow Interrupt Enable */
#define ECF__SHIFT            0x00 /* PCA Counter/Timer Overflow Interrupt Enable */
#define ECF__OVF_INT_DISABLED 0x00 /* Disable the CF interrupt. */
#define ECF__OVF_INT_ENABLED  0x01 /* Enable a PCA Counter/Timer Overflow interrupt request when CF is set. */

#define CPS__FMASK            0x0E /* PCA Counter/Timer Pulse Select */
#define CPS__SHIFT            0x01 /* PCA Counter/Timer Pulse Select */
#define CPS__SYSCLK_DIV_12    0x00 /* System clock divided by 12. */
#define CPS__SYSCLK_DIV_4     0x02 /* System clock divided by 4. */
#define CPS__T0_OVERFLOW      0x04 /* Timer 0 overflow. */
#define CPS__ECI              0x06 /* High-to-low transitions on ECI (max rate = system clock divided by 4). */
#define CPS__SYSCLK           0x08 /* System clock. */
#define CPS__EXTOSC_DIV_8     0x0A /* External clock divided by 8 (synchronized with the system clock). */
#define CPS__LFOSC_DIV_8      0x0C /* Low frequency oscillator divided by 8. */

#define CIDL__BMASK           0x80 /* PCA Counter/Timer Idle Control */
#define CIDL__SHIFT           0x07 /* PCA Counter/Timer Idle Control */
#define CIDL__NORMAL          0x00 /* PCA continues to function normally while the system controller is in Idle Mode. */
#define CIDL__SUSPEND         0x80 /* PCA operation is suspended while the system controller is in Idle Mode. */

