OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*------------------------------------------------------------------------------ */
/* PCA0POL Enums (PCA Output Polarity @ 0x96)                                    */
/*------------------------------------------------------------------------------ */
#define CEX0POL__BMASK   0x01 /* CEX0 Output Polarity */
#define CEX0POL__SHIFT   0x00 /* CEX0 Output Polarity */
#define CEX0POL__DEFAULT 0x00 /* Use default polarity. */
#define CEX0POL__INVERT  0x01 /* Invert polarity. */

#define CEX1POL__BMASK   0x02 /* CEX1 Output Polarity */
#define CEX1POL__SHIFT   0x01 /* CEX1 Output Polarity */
#define CEX1POL__DEFAULT 0x00 /* Use default polarity. */
#define CEX1POL__INVERT  0x02 /* Invert polarity. */

#define CEX2POL__BMASK   0x04 /* CEX2 Output Polarity */
#define CEX2POL__SHIFT   0x02 /* CEX2 Output Polarity */
#define CEX2POL__DEFAULT 0x00 /* Use default polarity. */
#define CEX2POL__INVERT  0x04 /* Invert polarity. */

/*------------------------------------------------------------------------------ */
/* PCA0PWM Enums (PCA PWM Configuration @ 0xF7)                                  */
/*------------------------------------------------------------------------------ */
#define CLSEL__FMASK             0x07 /* Cycle Length Select */
#define CLSEL__SHIFT             0x00 /* Cycle Length Select */
#define CLSEL__8_BITS            0x00 /* 8 bits. */
#define CLSEL__9_BITS            0x01 /* 9 bits. */
#define CLSEL__10_BITS           0x02 /* 10 bits. */
#define CLSEL__11_BITS           0x03 /* 11 bits. */

#define COVF__BMASK              0x20 /* Cycle Overflow Flag */
#define COVF__SHIFT              0x05 /* Cycle Overflow Flag */
#define COVF__NO_OVERFLOW        0x00 /* No overflow has occurred since the last time this bit was cleared. */
#define COVF__OVERFLOW           0x20 /* An overflow has occurred since the last time this bit was cleared. */

#define ECOV__BMASK              0x40 /* Cycle Overflow Interrupt Enable */
#define ECOV__SHIFT              0x06 /* Cycle Overflow Interrupt Enable */
#define ECOV__COVF_MASK_DISABLED 0x00 /* COVF will not generate PCA interrupts. */
#define ECOV__COVF_MASK_ENABLED  0x40 /* A PCA interrupt will be generated when COVF is set. */

#define ARSEL__BMASK             0x80 /* Auto-Reload Register Select */
#define ARSEL__SHIFT             0x07 /* Auto-Reload Register Select */
#define ARSEL__CAPTURE_COMPARE   0x00 /* Read/Write Capture/Compare Registers at PCA0CPHn and PCA0CPLn. */
#define ARSEL__AUTORELOAD        0x80 /* Read/Write Auto-Reload Registers at PCA0CPHn and PCA0CPLn. */

/*------------------------------------------------------------------------------ */
/* SPI0CFG Enums (SPI0 Configuration @ 0xA1)                                     */
/*------------------------------------------------------------------------------ */
#define RXBMT__BMASK                0x01 /* Receive Buffer Empty */
#define RXBMT__SHIFT                0x00 /* Receive Buffer Empty */
#define RXBMT__NOT_SET              0x00 /* New data is available in the receive buffer (Slave mode). */
#define RXBMT__SET                  0x01 /* No new data in the receive buffer (Slave mode). */

#define SRMT__BMASK                 0x02 /* Shift Register Empty */
#define SRMT__SHIFT                 0x01 /* Shift Register Empty */
#define SRMT__NOT_SET               0x00 /* The shift register is not empty. */
#define SRMT__SET                   0x02 /* The shift register is empty. */

#define NSSIN__BMASK                0x04 /* NSS Instantaneous Pin Input */
#define NSSIN__SHIFT                0x02 /* NSS Instantaneous Pin Input */
#define NSSIN__LOW                  0x00 /* The NSS pin is low. */
#define NSSIN__HIGH                 0x04 /* The NSS pin is high. */

#define SLVSEL__BMASK               0x08 /* Slave Selected Flag */
#define SLVSEL__SHIFT               0x03 /* Slave Selected Flag */
#define SLVSEL__NOT_SELECTED        0x00 /* The Slave is not selected (NSS is high). */
#define SLVSEL__SELECTED            0x08 /* The Slave is selected (NSS is low). */

#define CKPOL__BMASK                0x10 /* SPI0 Clock Polarity */
#define CKPOL__SHIFT                0x04 /* SPI0 Clock Polarity */
#define CKPOL__IDLE_LOW             0x00 /* SCK line low in idle state. */
#define CKPOL__IDLE_HIGH            0x10 /* SCK line high in idle state. */

#define CKPHA__BMASK                0x20 /* SPI0 Clock Phase */
#define CKPHA__SHIFT                0x05 /* SPI0 Clock Phase */
#define CKPHA__DATA_CENTERED_FIRST  0x00 /* Data centered on first edge of SCK period. */
#define CKPHA__DATA_CENTERED_SECOND 0x20 /* Data centered on second edge of SCK period. */

#define MSTEN__BMASK                0x40 /* Master Mode Enable */
#define MSTEN__SHIFT                0x06 /* Master Mode Enable */
#define MSTEN__MASTER_DISABLED      0x00 /* Disable master mode. Operate in slave mode. */
#define MSTEN__MASTER_ENABLED       0x40 /* Enable master mode. Operate as a master. */

#define SPIBSY__BMASK               0x80 /* SPI Busy */
#define SPIBSY__SHIFT               0x07 /* SPI Busy */
#define SPIBSY__NOT_SET             0x00 /* A SPI transfer is not in progress. */
#define SPIBSY__SET                 0x80 /* A SPI transfer is in progress. */

/*------------------------------------------------------------------------------ */
/* SPI0CN0 Enums (SPI0 Control @ 0xF8)                                           */
/*------------------------------------------------------------------------------ */
#define SPIEN__BMASK                  0x01 /* SPI0 Enable */
#define SPIEN__SHIFT                  0x00 /* SPI0 Enable */
#define SPIEN__DISABLED               0x00 /* Disable the SPI module. */
#define SPIEN__ENABLED                0x01 /* Enable the SPI module. */

#define TXBMT__BMASK                  0x02 /* Transmit Buffer Empty */
#define TXBMT__SHIFT                  0x01 /* Transmit Buffer Empty */
#define TXBMT__NOT_SET                0x00 /* The transmit buffer is not empty. */
#define TXBMT__SET                    0x02 /* The transmit buffer is empty. */

#define NSSMD__FMASK                  0x0C /* Slave Select Mode */
#define NSSMD__SHIFT                  0x02 /* Slave Select Mode */
#define NSSMD__3_WIRE                 0x00 /* 3-Wire Slave or 3-Wire Master Mode. NSS signal is not routed to a port pin. */
#define NSSMD__4_WIRE_SLAVE           0x04 /* 4-Wire Slave or Multi-Master Mode. NSS is an input to the device. */
#define NSSMD__4_WIRE_MASTER_NSS_LOW  0x08 /* 4-Wire Single-Master Mode. NSS is an output and logic low. */
#define NSSMD__4_WIRE_MASTER_NSS_HIGH 0x0C /* 4-Wire Single-Master Mode. NSS is an output and logic high. */

#define RXOVRN__BMASK                 0x10 /* Receive Overrun Flag */
#define RXOVRN__SHIFT                 0x04 /* Receive Overrun Flag */
#define RXOVRN__NOT_SET               0x00 /* A receive overrun did not occur. */
#define RXOVRN__SET                   0x10 /* A receive overrun occurred. */

#define MODF__BMASK                   0x20 /* Mode Fault Flag */
#define MODF__SHIFT                   0x05 /* Mode Fault Flag */
#define MODF__NOT_SET                 0x00 /* A master collision did not occur. */
#define MODF__SET                     0x20 /* A master collision occurred. */

#define WCOL__BMASK                   0x40 /* Write Collision Flag */
#define WCOL__SHIFT                   0x06 /* Write Collision Flag */
#define WCOL__NOT_SET                 0x00 /* A write collision did not occur. */
#define WCOL__SET                     0x40 /* A write collision occurred. */

#define SPIF__BMASK                   0x80 /* SPI0 Interrupt Flag */
#define SPIF__SHIFT                   0x07 /* SPI0 Interrupt Flag */
#define SPIF__NOT_SET                 0x00 /* A data transfer has not completed since the last time SPIF was cleared. */
#define SPIF__SET                     0x80 /* A data transfer completed. */

