OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*------------------------------------------------------------------------------ */
/* EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)                               */
/*------------------------------------------------------------------------------ */
#define ESMB0__BMASK     0x01 /* SMBus (SMB0) Interrupt Enable */
#define ESMB0__SHIFT     0x00 /* SMBus (SMB0) Interrupt Enable */
#define ESMB0__DISABLED  0x00 /* Disable all SMB0 interrupts. */
#define ESMB0__ENABLED   0x01 /* Enable interrupt requests generated by SMB0. */

#define EMAT__BMASK      0x02 /* Port Match Interrupts Enable */
#define EMAT__SHIFT      0x01 /* Port Match Interrupts Enable */
#define EMAT__DISABLED   0x00 /* Disable all Port Match interrupts. */
#define EMAT__ENABLED    0x02 /* Enable interrupt requests generated by a Port Match. */

#define EWADC0__BMASK    0x04 /* ADC0 Window Comparison Interrupt Enable */
#define EWADC0__SHIFT    0x02 /* ADC0 Window Comparison Interrupt Enable */
#define EWADC0__DISABLED 0x00 /* Disable ADC0 Window Comparison interrupt. */
#define EWADC0__ENABLED  0x04 /* Enable interrupt requests generated by ADC0 Window Compare flag (ADWINT). */

#define EADC0__BMASK     0x08 /* ADC0 Conversion Complete Interrupt Enable */
#define EADC0__SHIFT     0x03 /* ADC0 Conversion Complete Interrupt Enable */
#define EADC0__DISABLED  0x00 /* Disable ADC0 Conversion Complete interrupt. */
#define EADC0__ENABLED   0x08 /* Enable interrupt requests generated by the ADINT flag. */

#define EPCA0__BMASK     0x10 /* Programmable Counter Array (PCA0) Interrupt Enable */
#define EPCA0__SHIFT     0x04 /* Programmable Counter Array (PCA0) Interrupt Enable */
#define EPCA0__DISABLED  0x00 /* Disable all PCA0 interrupts. */
#define EPCA0__ENABLED   0x10 /* Enable interrupt requests generated by PCA0. */

#define ECP0__BMASK      0x20 /* Comparator0 (CP0) Interrupt Enable */
#define ECP0__SHIFT      0x05 /* Comparator0 (CP0) Interrupt Enable */
#define ECP0__DISABLED   0x00 /* Disable CP0 interrupts. */
#define ECP0__ENABLED    0x20 /* Enable interrupt requests generated by the comparator 0 CPRIF or CPFIF flags. */

#define ECP1__BMASK      0x40 /* Comparator1 (CP1) Interrupt Enable */
#define ECP1__SHIFT      0x06 /* Comparator1 (CP1) Interrupt Enable */
#define ECP1__DISABLED   0x00 /* Disable CP1 interrupts. */
#define ECP1__ENABLED    0x40 /* Enable interrupt requests generated by the comparator 1 CPRIF or CPFIF flags. */

#define ET3__BMASK       0x80 /* Timer 3 Interrupt Enable */
#define ET3__SHIFT       0x07 /* Timer 3 Interrupt Enable */
#define ET3__DISABLED    0x00 /* Disable Timer 3 interrupts. */
#define ET3__ENABLED     0x80 /* Enable interrupt requests generated by the TF3L or TF3H flags. */

/*------------------------------------------------------------------------------ */
/* EIP1 Enums (Extended Interrupt Priority 1 @ 0xF3)                             */
/*------------------------------------------------------------------------------ */
#define PSMB0__BMASK  0x01 /* SMBus (SMB0) Interrupt Priority Control */
#define PSMB0__SHIFT  0x00 /* SMBus (SMB0) Interrupt Priority Control */
#define PSMB0__LOW    0x00 /* SMB0 interrupt set to low priority level. */
#define PSMB0__HIGH   0x01 /* SMB0 interrupt set to high priority level. */

#define PMAT__BMASK   0x02 /* Port Match Interrupt Priority Control */
#define PMAT__SHIFT   0x01 /* Port Match Interrupt Priority Control */
#define PMAT__LOW     0x00 /* Port Match interrupt set to low priority level. */
#define PMAT__HIGH    0x02 /* Port Match interrupt set to high priority level. */

#define PWADC0__BMASK 0x04 /* ADC0 Window Comparator Interrupt Priority Control */
#define PWADC0__SHIFT 0x02 /* ADC0 Window Comparator Interrupt Priority Control */
#define PWADC0__LOW   0x00 /* ADC0 Window interrupt set to low priority level. */
#define PWADC0__HIGH  0x04 /* ADC0 Window interrupt set to high priority level. */

#define PADC0__BMASK  0x08 /* ADC0 Conversion Complete Interrupt Priority Control */
#define PADC0__SHIFT  0x03 /* ADC0 Conversion Complete Interrupt Priority Control */
#define PADC0__LOW    0x00 /* ADC0 Conversion Complete interrupt set to low priority level. */
#define PADC0__HIGH   0x08 /* ADC0 Conversion Complete interrupt set to high priority level. */

#define PPCA0__BMASK  0x10 /* Programmable Counter Array (PCA0) Interrupt Priority Control */
#define PPCA0__SHIFT  0x04 /* Programmable Counter Array (PCA0) Interrupt Priority Control */
#define PPCA0__LOW    0x00 /* PCA0 interrupt set to low priority level. */
#define PPCA0__HIGH   0x10 /* PCA0 interrupt set to high priority level. */

#define PCP0__BMASK   0x20 /* Comparator0 (CP0) Interrupt Priority Control */
#define PCP0__SHIFT   0x05 /* Comparator0 (CP0) Interrupt Priority Control */
#define PCP0__LOW     0x00 /* CP0 interrupt set to low priority level. */
#define PCP0__HIGH    0x20 /* CP0 interrupt set to high priority level. */

#define PCP1__BMASK   0x40 /* Comparator1 (CP1) Interrupt Priority Control */
#define PCP1__SHIFT   0x06 /* Comparator1 (CP1) Interrupt Priority Control */
#define PCP1__LOW     0x00 /* CP1 interrupt set to low priority level. */
#define PCP1__HIGH    0x40 /* CP1 interrupt set to high priority level. */

#define PT3__BMASK    0x80 /* Timer 3 Interrupt Priority Control */
#define PT3__SHIFT    0x07 /* Timer 3 Interrupt Priority Control */
#define PT3__LOW      0x00 /* Timer 3 interrupts set to low priority level. */
#define PT3__HIGH     0x80 /* Timer 3 interrupts set to high priority level. */

/*------------------------------------------------------------------------------ */
/* IE Enums (Interrupt Enable @ 0xA8)                                            */
/*------------------------------------------------------------------------------ */
#define EX0__BMASK      0x01 /* External Interrupt 0 Enable */
#define EX0__SHIFT      0x00 /* External Interrupt 0 Enable */
#define EX0__DISABLED   0x00 /* Disable external interrupt 0. */
#define EX0__ENABLED    0x01 /* Enable interrupt requests generated by the INT0 input. */

#define ET0__BMASK      0x02 /* Timer 0 Interrupt Enable */
#define ET0__SHIFT      0x01 /* Timer 0 Interrupt Enable */
#define ET0__DISABLED   0x00 /* Disable all Timer 0 interrupt. */
#define ET0__ENABLED    0x02 /* Enable interrupt requests generated by the TF0 flag. */

#define EX1__BMASK      0x04 /* External Interrupt 1 Enable */
#define EX1__SHIFT      0x02 /* External Interrupt 1 Enable */
#define EX1__DISABLED   0x00 /* Disable external interrupt 1. */
#define EX1__ENABLED    0x04 /* Enable interrupt requests generated by the INT1 input. */

#define ET1__BMASK      0x08 /* Timer 1 Interrupt Enable */
#define ET1__SHIFT      0x03 /* Timer 1 Interrupt Enable */
#define ET1__DISABLED   0x00 /* Disable all Timer 1 interrupt. */
#define ET1__ENABLED    0x08 /* Enable interrupt requests generated by the TF1 flag. */

#define ES0__BMASK      0x10 /* UART0 Interrupt Enable */
#define ES0__SHIFT      0x04 /* UART0 Interrupt Enable */
#define ES0__DISABLED   0x00 /* Disable UART0 interrupt. */
#define ES0__ENABLED    0x10 /* Enable UART0 interrupt. */

