OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define ET2__BMASK      0x20 /* Timer 2 Interrupt Enable */
#define ET2__SHIFT      0x05 /* Timer 2 Interrupt Enable */
#define ET2__DISABLED   0x00 /* Disable Timer 2 interrupt. */
#define ET2__ENABLED    0x20 /* Enable interrupt requests generated by the TF2L or TF2H flags. */

#define ESPI0__BMASK    0x40 /* SPI0 Interrupt Enable */
#define ESPI0__SHIFT    0x06 /* SPI0 Interrupt Enable */
#define ESPI0__DISABLED 0x00 /* Disable all SPI0 interrupts. */
#define ESPI0__ENABLED  0x40 /* Enable interrupt requests generated by SPI0. */

#define EA__BMASK       0x80 /* All Interrupts Enable */
#define EA__SHIFT       0x07 /* All Interrupts Enable */
#define EA__DISABLED    0x00 /* Disable all interrupt sources. */
#define EA__ENABLED     0x80 /* Enable each interrupt according to its individual mask setting. */

/*------------------------------------------------------------------------------ */
/* SMB0ADM Enums (SMBus 0 Slave Address Mask @ 0xD6)                             */
/*------------------------------------------------------------------------------ */
#define EHACK__BMASK             0x01 /* Hardware Acknowledge Enable */
#define EHACK__SHIFT             0x00 /* Hardware Acknowledge Enable */
#define EHACK__ADR_ACK_MANUAL    0x00 /* Firmware must manually acknowledge all incoming address and data bytes. */
#define EHACK__ADR_ACK_AUTOMATIC 0x01 /* Automatic slave address recognition and hardware acknowledge is enabled. */

#define SLVM__FMASK              0xFE /* SMBus Slave Address Mask */
#define SLVM__SHIFT              0x01 /* SMBus Slave Address Mask */

/*------------------------------------------------------------------------------ */
/* SMB0ADR Enums (SMBus 0 Slave Address @ 0xD7)                                  */
/*------------------------------------------------------------------------------ */
#define GC__BMASK      0x01 /* General Call Address Enable */
#define GC__SHIFT      0x00 /* General Call Address Enable */
#define GC__IGNORED    0x00 /* General Call Address is ignored. */
#define GC__RECOGNIZED 0x01 /* General Call Address is recognized. */

#define SLV__FMASK     0xFE /* SMBus Hardware Slave Address */
#define SLV__SHIFT     0x01 /* SMBus Hardware Slave Address */

/*------------------------------------------------------------------------------ */
/* SMB0CF Enums (SMBus 0 Configuration @ 0xC1)                                   */
/*------------------------------------------------------------------------------ */
#define SMBCS__FMASK             0x03 /* SMBus Clock Source Selection */
#define SMBCS__SHIFT             0x00 /* SMBus Clock Source Selection */
#define SMBCS__TIMER0            0x00 /* Timer 0 Overflow. */
#define SMBCS__TIMER1            0x01 /* Timer 1 Overflow. */
#define SMBCS__TIMER2_HIGH       0x02 /* Timer 2 High Byte Overflow. */
#define SMBCS__TIMER2_LOW        0x03 /* Timer 2 Low Byte Overflow. */

#define SMBFTE__BMASK            0x04 /* SMBus Free Timeout Detection Enable */
#define SMBFTE__SHIFT            0x02 /* SMBus Free Timeout Detection Enable */
#define SMBFTE__FREE_TO_DISABLED 0x00 /* Disable bus free timeouts. */
#define SMBFTE__FREE_TO_ENABLED  0x04 /* Enable bus free timeouts. The bus the bus will be considered free if SCL and SDA remain high for more than 10 SMBus clock source periods. */

#define SMBTOE__BMASK            0x08 /* SMBus SCL Timeout Detection Enable */
#define SMBTOE__SHIFT            0x03 /* SMBus SCL Timeout Detection Enable */
#define SMBTOE__SCL_TO_DISABLED  0x00 /* Disable SCL low timeouts. */
#define SMBTOE__SCL_TO_ENABLED   0x08 /* Enable SCL low timeouts. */

#define EXTHOLD__BMASK           0x10 /* SMBus Setup and Hold Time Extension Enable */
#define EXTHOLD__SHIFT           0x04 /* SMBus Setup and Hold Time Extension Enable */
#define EXTHOLD__DISABLED        0x00 /* Disable SDA extended setup and hold times. */
#define EXTHOLD__ENABLED         0x10 /* Enable SDA extended setup and hold times. */

#define BUSY__BMASK              0x20 /* SMBus Busy Indicator */
#define BUSY__SHIFT              0x05 /* SMBus Busy Indicator */
#define BUSY__NOT_SET            0x00 /* The bus is not busy. */
#define BUSY__SET                0x20 /* The bus is busy and a transfer is currently in progress. */

#define INH__BMASK               0x40 /* SMBus Slave Inhibit */
#define INH__SHIFT               0x06 /* SMBus Slave Inhibit */
#define INH__SLAVE_ENABLED       0x00 /* Slave states are enabled. */
#define INH__SLAVE_DISABLED      0x40 /* Slave states are inhibited. */

#define ENSMB__BMASK             0x80 /* SMBus Enable */
#define ENSMB__SHIFT             0x07 /* SMBus Enable */
#define ENSMB__DISABLED          0x00 /* Disable the SMBus module. */
#define ENSMB__ENABLED           0x80 /* Enable the SMBus module. */

/*------------------------------------------------------------------------------ */
/* SMB0CN0 Enums (SMBus 0 Control @ 0xC0)                                        */
/*------------------------------------------------------------------------------ */
#define SI__BMASK           0x01 /* SMBus Interrupt Flag */
#define SI__SHIFT           0x00 /* SMBus Interrupt Flag */
#define SI__NOT_SET         0x00 /* */
#define SI__SET             0x01 /* */

#define ACK__BMASK          0x02 /* SMBus Acknowledge */
#define ACK__SHIFT          0x01 /* SMBus Acknowledge */
#define ACK__NOT_SET        0x00 /* Generate a NACK, or the response was a NACK. */
#define ACK__SET            0x02 /* Generate an ACK, or the response was an ACK. */

#define ARBLOST__BMASK      0x04 /* SMBus Arbitration Lost Indicator */
#define ARBLOST__SHIFT      0x02 /* SMBus Arbitration Lost Indicator */
#define ARBLOST__NOT_SET    0x00 /* No arbitration error. */
#define ARBLOST__ERROR      0x04 /* Arbitration error occurred. */

#define ACKRQ__BMASK        0x08 /* SMBus Acknowledge Request */
#define ACKRQ__SHIFT        0x03 /* SMBus Acknowledge Request */
#define ACKRQ__NOT_SET      0x00 /* No ACK requested. */
#define ACKRQ__REQUESTED    0x08 /* ACK requested. */

#define STO__BMASK          0x10 /* SMBus Stop Flag */
#define STO__SHIFT          0x04 /* SMBus Stop Flag */
#define STO__NOT_SET        0x00 /* A STOP is not pending. */
#define STO__SET            0x10 /* Generate a STOP or a STOP is currently pending. */

#define STA__BMASK          0x20 /* SMBus Start Flag */
#define STA__SHIFT          0x05 /* SMBus Start Flag */
#define STA__NOT_SET        0x00 /* A START was not detected. */
#define STA__SET            0x20 /* Generate a START, repeated START, or a START is currently pending. */

