OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define TXMODE__BMASK       0x40 /* SMBus Transmit Mode Indicator */
#define TXMODE__SHIFT       0x06 /* SMBus Transmit Mode Indicator */
#define TXMODE__RECEIVER    0x00 /* SMBus in Receiver Mode. */
#define TXMODE__TRANSMITTER 0x40 /* SMBus in Transmitter Mode. */

#define MASTER__BMASK       0x80 /* SMBus Master/Slave Indicator */
#define MASTER__SHIFT       0x07 /* SMBus Master/Slave Indicator */
#define MASTER__SLAVE       0x00 /* SMBus operating in slave mode. */
#define MASTER__MASTER      0x80 /* SMBus operating in master mode. */

/*------------------------------------------------------------------------------ */
/* SMB0TC Enums (SMBus 0 Timing and Pin Control @ 0xAC)                          */
/*------------------------------------------------------------------------------ */
#define SDD__FMASK         0x03 /* SMBus Start Detection Window */
#define SDD__SHIFT         0x00 /* SMBus Start Detection Window */
#define SDD__NONE          0x00 /* No additional hold time window (0-1 SYSCLK). */
#define SDD__ADD_2_SYSCLKS 0x01 /* Increase hold time window to 2-3 SYSCLKs. */
#define SDD__ADD_4_SYSCLKS 0x02 /* Increase hold time window to 4-5 SYSCLKs. */
#define SDD__ADD_8_SYSCLKS 0x03 /* Increase hold time window to 8-9 SYSCLKs. */

#define SWAP__BMASK        0x80 /* SMBus Swap Pins */
#define SWAP__SHIFT        0x07 /* SMBus Swap Pins */
#define SWAP__SDA_LOW_PIN  0x00 /* SDA is mapped to the lower-numbered port pin, and SCL is mapped to the higher-numbered port pin. */
#define SWAP__SDA_HIGH_PIN 0x80 /* SCL is mapped to the lower-numbered port pin, and SDA is mapped to the higher-numbered port pin. */

/*------------------------------------------------------------------------------ */
/* SCON0 Enums (UART0 Serial Port Control @ 0x98)                                */
/*------------------------------------------------------------------------------ */
#define RI__BMASK             0x01 /* Receive Interrupt Flag */
#define RI__SHIFT             0x00 /* Receive Interrupt Flag */
#define RI__NOT_SET           0x00 /* A byte of data has not been received by UART0. */
#define RI__SET               0x01 /* UART0 received a byte of data. */

#define TI__BMASK             0x02 /* Transmit Interrupt Flag */
#define TI__SHIFT             0x01 /* Transmit Interrupt Flag */
#define TI__NOT_SET           0x00 /* A byte of data has not been transmitted by UART0. */
#define TI__SET               0x02 /* UART0 transmitted a byte of data. */

#define RB8__BMASK            0x04 /* Ninth Receive Bit */
#define RB8__SHIFT            0x02 /* Ninth Receive Bit */
#define RB8__CLEARED_TO_0     0x00 /* In Mode 0, the STOP bit was 0. In Mode 1, the 9th bit was 0. */
#define RB8__SET_TO_1         0x04 /* In Mode 0, the STOP bit was 1. In Mode 1, the 9th bit was 1. */

#define TB8__BMASK            0x08 /* Ninth Transmission Bit */
#define TB8__SHIFT            0x03 /* Ninth Transmission Bit */
#define TB8__CLEARED_TO_0     0x00 /* In Mode 1, set the 9th transmission bit to 0. */
#define TB8__SET_TO_1         0x08 /* In Mode 1, set the 9th transmission bit to 1. */

#define REN__BMASK            0x10 /* Receive Enable */
#define REN__SHIFT            0x04 /* Receive Enable */
#define REN__RECEIVE_DISABLED 0x00 /* UART0 reception disabled. */
#define REN__RECEIVE_ENABLED  0x10 /* UART0 reception enabled. */

#define MCE__BMASK            0x20 /* Multiprocessor Communication Enable */
#define MCE__SHIFT            0x05 /* Multiprocessor Communication Enable */
#define MCE__MULTI_DISABLED   0x00 /* Ignore level of 9th bit / Stop bit. */
#define MCE__MULTI_ENABLED    0x20 /* RI is set and an interrupt is generated only when the stop bit is logic 1 (Mode 0) or when the 9th bit is logic 1 (Mode 1). */

#define SMODE__BMASK          0x80 /* Serial Port 0 Operation Mode */
#define SMODE__SHIFT          0x07 /* Serial Port 0 Operation Mode */
#define SMODE__8_BIT          0x00 /* 8-bit UART with Variable Baud Rate (Mode 0). */
#define SMODE__9_BIT          0x80 /* 9-bit UART with Variable Baud Rate (Mode 1). */

/*------------------------------------------------------------------------------ */
/* CMP0CN0 Enums (Comparator 0 Control 0 @ 0x9B)                                 */
/*------------------------------------------------------------------------------ */
#define CPHYN__FMASK                0x03 /* Comparator Negative Hysteresis Control */
#define CPHYN__SHIFT                0x00 /* Comparator Negative Hysteresis Control */
#define CPHYN__DISABLED             0x00 /* Negative Hysteresis disabled. */
#define CPHYN__ENABLED_MODE1        0x01 /* Negative Hysteresis = Hysteresis 1. */
#define CPHYN__ENABLED_MODE2        0x02 /* Negative Hysteresis = Hysteresis 2. */
#define CPHYN__ENABLED_MODE3        0x03 /* Negative Hysteresis = Hysteresis 3 (Maximum). */

#define CPHYP__FMASK                0x0C /* Comparator Positive Hysteresis Control */
#define CPHYP__SHIFT                0x02 /* Comparator Positive Hysteresis Control */
#define CPHYP__DISABLED             0x00 /* Positive Hysteresis disabled. */
#define CPHYP__ENABLED_MODE1        0x04 /* Positive Hysteresis = Hysteresis 1. */
#define CPHYP__ENABLED_MODE2        0x08 /* Positive Hysteresis = Hysteresis 2. */
#define CPHYP__ENABLED_MODE3        0x0C /* Positive Hysteresis = Hysteresis 3 (Maximum). */

#define CPFIF__BMASK                0x10 /* Comparator Falling-Edge Flag */
#define CPFIF__SHIFT                0x04 /* Comparator Falling-Edge Flag */
#define CPFIF__NOT_SET              0x00 /* No comparator falling edge has occurred since this flag was last cleared. */
#define CPFIF__FALLING_EDGE         0x10 /* Comparator falling edge has occurred. */

#define CPRIF__BMASK                0x20 /* Comparator Rising-Edge Flag */
#define CPRIF__SHIFT                0x05 /* Comparator Rising-Edge Flag */
#define CPRIF__NOT_SET              0x00 /* No comparator rising edge has occurred since this flag was last cleared. */
#define CPRIF__RISING_EDGE          0x20 /* Comparator rising edge has occurred. */

