OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define CPOUT__BMASK                0x40 /* Comparator Output State Flag */
#define CPOUT__SHIFT                0x06 /* Comparator Output State Flag */
#define CPOUT__POS_LESS_THAN_NEG    0x00 /* Voltage on CP0P < CP0N. */
#define CPOUT__POS_GREATER_THAN_NEG 0x40 /* Voltage on CP0P > CP0N. */

#define CPEN__BMASK                 0x80 /* Comparator Enable */
#define CPEN__SHIFT                 0x07 /* Comparator Enable */
#define CPEN__DISABLED              0x00 /* Comparator disabled. */
#define CPEN__ENABLED               0x80 /* Comparator enabled. */

/*------------------------------------------------------------------------------ */
/* CMP0MD Enums (Comparator 0 Mode @ 0x9D)                                       */
/*------------------------------------------------------------------------------ */
#define CPMD__FMASK              0x03 /* Comparator Mode Select */
#define CPMD__SHIFT              0x00 /* Comparator Mode Select */
#define CPMD__MODE0              0x00 /* Mode 0 (Fastest Response Time, Highest Power */
/* Consumption) */
#define CPMD__MODE1              0x01 /* Mode 1 */
#define CPMD__MODE2              0x02 /* Mode 2 */
#define CPMD__MODE3              0x03 /* Mode 3 (Slowest Response Time, Lowest Power */
/* Consumption) */

#define CPFIE__BMASK             0x10 /* Comparator Falling-Edge Interrupt Enable */
#define CPFIE__SHIFT             0x04 /* Comparator Falling-Edge Interrupt Enable */
#define CPFIE__FALL_INT_DISABLED 0x00 /* Comparator falling-edge interrupt disabled. */
#define CPFIE__FALL_INT_ENABLED  0x10 /* Comparator falling-edge interrupt enabled. */

#define CPRIE__BMASK             0x20 /* Comparator Rising-Edge Interrupt Enable */
#define CPRIE__SHIFT             0x05 /* Comparator Rising-Edge Interrupt Enable */
#define CPRIE__RISE_INT_DISABLED 0x00 /* Comparator rising-edge interrupt disabled. */
#define CPRIE__RISE_INT_ENABLED  0x20 /* Comparator rising-edge interrupt enabled. */

#define CPLOUT__BMASK            0x80 /* Comparator Latched Output Flag */
#define CPLOUT__SHIFT            0x07 /* Comparator Latched Output Flag */
#define CPLOUT__LOW              0x00 /* Comparator output was logic low at last PCA overflow. */
#define CPLOUT__HIGH             0x80 /* Comparator output was logic high at last PCA overflow. */
#define CPMD__FMASK              0x03 /* Comparator Mode Select */
#define CPMD__SHIFT              0x00 /* Comparator Mode Select */
#define CPMD__MODE0              0x00 /* Mode 0 (Fastest Response Time, Highest Power Consumption) */
#define CPMD__MODE1              0x01 /* Mode 1 */
#define CPMD__MODE2              0x02 /* Mode 2 */
#define CPMD__MODE3              0x03 /* Mode 3 (Slowest Response Time, Lowest Power Consumption) */

#define CPFIE__BMASK             0x10 /* Comparator Falling-Edge Interrupt Enable */
#define CPFIE__SHIFT             0x04 /* Comparator Falling-Edge Interrupt Enable */
#define CPFIE__FALL_INT_DISABLED 0x00 /* Comparator falling-edge interrupt disabled. */
#define CPFIE__FALL_INT_ENABLED  0x10 /* Comparator falling-edge interrupt enabled. */

#define CPRIE__BMASK             0x20 /* Comparator Rising-Edge Interrupt Enable */
#define CPRIE__SHIFT             0x05 /* Comparator Rising-Edge Interrupt Enable */
#define CPRIE__RISE_INT_DISABLED 0x00 /* Comparator rising-edge interrupt disabled. */
#define CPRIE__RISE_INT_ENABLED  0x20 /* Comparator rising-edge interrupt enabled. */

#define CPLOUT__BMASK            0x80 /* Comparator Latched Output Flag */
#define CPLOUT__SHIFT            0x07 /* Comparator Latched Output Flag */
#define CPLOUT__LOW              0x00 /* Comparator output was logic low at last PCA overflow. */
#define CPLOUT__HIGH             0x80 /* Comparator output was logic high at last PCA overflow. */

/*------------------------------------------------------------------------------ */
/* CMP0MX Enums (Comparator 0 Multiplexer Selection @ 0x9F)                      */
/*------------------------------------------------------------------------------ */
#define CMXP__FMASK   0x0F /* Comparator Positive Input MUX Selection */
#define CMXP__SHIFT   0x00 /* Comparator Positive Input MUX Selection */
#define CMXP__CMP0P0  0x00 /* External pin CMP0P.0. */
#define CMXP__CMP0P1  0x01 /* External pin CMP0P.1. */
#define CMXP__CMP0P2  0x02 /* External pin CMP0P.2. */
#define CMXP__CMP0P3  0x03 /* External pin CMP0P.3. */
#define CMXP__CMP0P4  0x04 /* External pin CMP0P.4. */
#define CMXP__CMP0P5  0x05 /* External pin CMP0P.5. */
#define CMXP__CMP0P6  0x06 /* External pin CMP0P.6. */
#define CMXP__CMP0P7  0x07 /* External pin CMP0P.7. */
#define CMXP__LDO_OUT 0x08 /* External pin CMP0P.8. */
#define CMXP__NONE    0x0F /* No input selected. */

#define CMXN__FMASK   0xF0 /* Comparator Negative Input MUX Selection */
#define CMXN__SHIFT   0x04 /* Comparator Negative Input MUX Selection */
#define CMXN__CMP0N0  0x00 /* External pin CMP0N.0. */
#define CMXN__CMP0N1  0x10 /* External pin CMP0N.1. */
#define CMXN__CMP0N2  0x20 /* External pin CMP0N.2. */
#define CMXN__CMP0N3  0x30 /* External pin CMP0N.3. */
#define CMXN__CMP0N4  0x40 /* External pin CMP0N.4. */
#define CMXN__CMP0N5  0x50 /* External pin CMP0N.5. */
#define CMXN__CMP0N6  0x60 /* External pin CMP0N.6. */
#define CMXN__CMP0N7  0x70 /* External pin CMP0N.7. */
#define CMXN__GND     0x80 /* External pin CMP0N.8. */
#define CMXN__NONE    0xF0 /* No input selected. */

/*------------------------------------------------------------------------------ */
/* CMP1CN0 Enums (Comparator 1 Control 0 @ 0xBF)                                 */
/*------------------------------------------------------------------------------ */
#define CPHYN__FMASK                0x03 /* Comparator Negative Hysteresis Control */
#define CPHYN__SHIFT                0x00 /* Comparator Negative Hysteresis Control */
#define CPHYN__DISABLED             0x00 /* Negative Hysteresis disabled. */
#define CPHYN__ENABLED_MODE1        0x01 /* Negative Hysteresis = Hysteresis 1. */
#define CPHYN__ENABLED_MODE2        0x02 /* Negative Hysteresis = Hysteresis 2. */
#define CPHYN__ENABLED_MODE3        0x03 /* Negative Hysteresis = Hysteresis 3 (Maximum). */

#define CPHYP__FMASK                0x0C /* Comparator Positive Hysteresis Control */
#define CPHYP__SHIFT                0x02 /* Comparator Positive Hysteresis Control */
#define CPHYP__DISABLED             0x00 /* Positive Hysteresis disabled. */
#define CPHYP__ENABLED_MODE1        0x04 /* Positive Hysteresis = Hysteresis 1. */
#define CPHYP__ENABLED_MODE2        0x08 /* Positive Hysteresis = Hysteresis 2. */
#define CPHYP__ENABLED_MODE3        0x0C /* Positive Hysteresis = Hysteresis 3 (Maximum). */

#define CPFIF__BMASK                0x10 /* Comparator Falling-Edge Flag */
#define CPFIF__SHIFT                0x04 /* Comparator Falling-Edge Flag */
#define CPFIF__NOT_SET              0x00 /* No comparator falling edge has occurred since this flag was last cleared. */
#define CPFIF__FALLING_EDGE         0x10 /* Comparator falling edge has occurred. */

#define CPRIF__BMASK                0x20 /* Comparator Rising-Edge Flag */
#define CPRIF__SHIFT                0x05 /* Comparator Rising-Edge Flag */
#define CPRIF__NOT_SET              0x00 /* No comparator rising edge has occurred since this flag was last cleared. */
#define CPRIF__RISING_EDGE          0x20 /* Comparator rising edge has occurred. */

