OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define CPOUT__BMASK                0x40 /* Comparator Output State Flag */
#define CPOUT__SHIFT                0x06 /* Comparator Output State Flag */
#define CPOUT__POS_LESS_THAN_NEG    0x00 /* Voltage on CP1P < CP1N. */
#define CPOUT__POS_GREATER_THAN_NEG 0x40 /* Voltage on CP1P > CP1N. */

#define CPEN__BMASK                 0x80 /* Comparator Enable */
#define CPEN__SHIFT                 0x07 /* Comparator Enable */
#define CPEN__DISABLED              0x00 /* Comparator disabled. */
#define CPEN__ENABLED               0x80 /* Comparator enabled. */

/*------------------------------------------------------------------------------ */
/* CMP1MD Enums (Comparator 1 Mode @ 0xAB)                                       */
/*------------------------------------------------------------------------------ */
#define CPMD__FMASK              0x03 /* Comparator Mode Select */
#define CPMD__SHIFT              0x00 /* Comparator Mode Select */
#define CPMD__MODE0              0x00 /* Mode 0 (Fastest Response Time, Highest Power Consumption) */
#define CPMD__MODE1              0x01 /* Mode 1 */
#define CPMD__MODE2              0x02 /* Mode 2 */
#define CPMD__MODE3              0x03 /* Mode 3 (Slowest Response Time, Lowest Power Consumption) */

#define CPFIE__BMASK             0x10 /* Comparator Falling-Edge Interrupt Enable */
#define CPFIE__SHIFT             0x04 /* Comparator Falling-Edge Interrupt Enable */
#define CPFIE__FALL_INT_DISABLED 0x00 /* Comparator falling-edge interrupt disabled. */
#define CPFIE__FALL_INT_ENABLED  0x10 /* Comparator falling-edge interrupt enabled. */

#define CPRIE__BMASK             0x20 /* Comparator Rising-Edge Interrupt Enable */
#define CPRIE__SHIFT             0x05 /* Comparator Rising-Edge Interrupt Enable */
#define CPRIE__RISE_INT_DISABLED 0x00 /* Comparator rising-edge interrupt disabled. */
#define CPRIE__RISE_INT_ENABLED  0x20 /* Comparator rising-edge interrupt enabled. */

#define CPLOUT__BMASK            0x80 /* Comparator Latched Output Flag */
#define CPLOUT__SHIFT            0x07 /* Comparator Latched Output Flag */
#define CPLOUT__LOW              0x00 /* Comparator output was logic low at last PCA overflow. */
#define CPLOUT__HIGH             0x80 /* Comparator output was logic high at last PCA overflow. */

/*------------------------------------------------------------------------------ */
/* CMP1MX Enums (Comparator 1 Multiplexer Selection @ 0xAA)                      */
/*------------------------------------------------------------------------------ */
#define CMXP__FMASK   0x0F /* Comparator Positive Input MUX Selection */
#define CMXP__SHIFT   0x00 /* Comparator Positive Input MUX Selection */
#define CMXP__CMP1P0  0x00 /* External pin CMP1P.0. */
#define CMXP__CMP1P1  0x01 /* External pin CMP1P.1. */
#define CMXP__CMP1P2  0x02 /* External pin CMP1P.2. */
#define CMXP__CMP1P3  0x03 /* External pin CMP1P.3. */
#define CMXP__CMP1P4  0x04 /* External pin CMP1P.4. */
#define CMXP__CMP1P5  0x05 /* External pin CMP1P.5. */
#define CMXP__CMP1P6  0x06 /* External pin CMP1P.6. */
#define CMXP__CMP1P7  0x07 /* External pin CMP1P.7. */
#define CMXP__LDO_OUT 0x08 /* External pin CMP1P.8. */
#define CMXP__NONE    0x0F /* No input selected. */

#define CMXN__FMASK   0xF0 /* Comparator Negative Input MUX Selection */
#define CMXN__SHIFT   0x04 /* Comparator Negative Input MUX Selection */
#define CMXN__CMP1N0  0x00 /* External pin CMP1N.0. */
#define CMXN__CMP1N1  0x10 /* External pin CMP1N.1. */
#define CMXN__CMP1N2  0x20 /* External pin CMP1N.2. */
#define CMXN__CMP1N3  0x30 /* External pin CMP1N.3. */
#define CMXN__CMP1N4  0x40 /* External pin CMP1N.4. */
#define CMXN__CMP1N5  0x50 /* External pin CMP1N.5. */
#define CMXN__CMP1N6  0x60 /* External pin CMP1N.6. */
#define CMXN__CMP1N7  0x70 /* External pin CMP1N.7. */
#define CMXN__GND     0x80 /* External pin CMP1N.8. */
#define CMXN__NONE    0xF0 /* No input selected. */

/*------------------------------------------------------------------------------ */
/* CRC0AUTO Enums (CRC0 Automatic Control @ 0xD2)                                */
/*------------------------------------------------------------------------------ */
#define CRCST__FMASK     0x3F /* Automatic CRC Calculation Starting Block */
#define CRCST__SHIFT     0x00 /* Automatic CRC Calculation Starting Block */

#define AUTOEN__BMASK    0x80 /* Automatic CRC Calculation Enable */
#define AUTOEN__SHIFT    0x07 /* Automatic CRC Calculation Enable */
#define AUTOEN__DISABLED 0x00 /* Disable automatic CRC operations on flash. */
#define AUTOEN__ENABLED  0x80 /* Enable automatic CRC operations on flash. */

/*------------------------------------------------------------------------------ */
/* CRC0CN0 Enums (CRC0 Control 0 @ 0xCE)                                         */
/*------------------------------------------------------------------------------ */
#define CRCPNT__BMASK        0x01 /* CRC Result Pointer */
#define CRCPNT__SHIFT        0x00 /* CRC Result Pointer */
#define CRCPNT__ACCESS_LOWER 0x00 /* CRC0DAT accesses bits 7-0 of the 16-bit CRC result. */
#define CRCPNT__ACCESS_UPPER 0x01 /* CRC0DAT accesses bits 15-8 of the 16-bit CRC result. */

#define CRCVAL__BMASK        0x04 /* CRC Initialization Value */
#define CRCVAL__SHIFT        0x02 /* CRC Initialization Value */
#define CRCVAL__SET_ZEROES   0x00 /* CRC result is set to 0x0000 on write of 1 to CRCINIT. */
#define CRCVAL__SET_ONES     0x04 /* CRC result is set to 0xFFFF on write of 1 to CRCINIT. */

#define CRCINIT__BMASK       0x08 /* CRC Initialization Enable */
#define CRCINIT__SHIFT       0x03 /* CRC Initialization Enable */
#define CRCINIT__DO_NOT_INIT 0x00 /* Do not initialize the CRC result. */
#define CRCINIT__INIT        0x08 /* Initialize the CRC result to ones or zeroes vased on the value of CRCVAL. */

/*------------------------------------------------------------------------------ */
/* CRC0CNT Enums (CRC0 Automatic Flash Sector Count @ 0xD3)                      */
/*------------------------------------------------------------------------------ */
#define CRCCNT__FMASK  0x1F /* Automatic CRC Calculation Block Count */
#define CRCCNT__SHIFT  0x00 /* Automatic CRC Calculation Block Count */

#define CRCDN__BMASK   0x80 /* Automatic CRC Calculation Complete */
#define CRCDN__SHIFT   0x07 /* Automatic CRC Calculation Complete */
#define CRCDN__NOT_SET 0x00 /* A CRC calculation is in progress. */
#define CRCDN__SET     0x80 /* A CRC calculation is not in progress. */


