OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
/*------------------------------------------------------------------------------ */
/* DERIVID Enums (Derivative Identification @ 0xAD)                              */
/*------------------------------------------------------------------------------ */
#define DERIVID__FMASK              0xFF /* Derivative ID */
#define DERIVID__SHIFT              0x00 /* Derivative ID */
#define DERIVID__EFM8BB10F8G_QSOP24 0x01 /* EFM8BB10F8G-{R}-QSOP24 */
#define DERIVID__EFM8BB10F8G_QFN20  0x02 /* EFM8BB10F8G-{R}-QFN20 */
#define DERIVID__EFM8BB10F8G_SOIC16 0x03 /* EFM8BB10F8G-{R}-SOIC16 */
#define DERIVID__EFM8BB10F4G_QFN20  0x05 /* EFM8BB10F4G-{R}-QFN20 */
#define DERIVID__EFM8BB10F2G_QFN20  0x08 /* EFM8BB10F2G-{R}-QFN20 */

/*------------------------------------------------------------------------------ */
/* REVID Enums (Revision Identifcation @ 0xB6)                                   */
/*------------------------------------------------------------------------------ */
#define REVID__FMASK 0xFF /* Revision ID */
#define REVID__SHIFT 0x00 /* Revision ID */
#define REVID__REV_A 0x02 /* Revision A */

/*------------------------------------------------------------------------------ */
/* IT01CF Enums (INT0/INT1 Configuration @ 0xE4)                                 */
/*------------------------------------------------------------------------------ */
#define IN0SL__FMASK       0x07 /* INT0 Port Pin Selection */
#define IN0SL__SHIFT       0x00 /* INT0 Port Pin Selection */
#define IN0SL__P0_0        0x00 /* Select P0.0. */
#define IN0SL__P0_1        0x01 /* Select P0.1. */
#define IN0SL__P0_2        0x02 /* Select P0.2. */
#define IN0SL__P0_3        0x03 /* Select P0.3. */
#define IN0SL__P0_4        0x04 /* Select P0.4. */
#define IN0SL__P0_5        0x05 /* Select P0.5. */
#define IN0SL__P0_6        0x06 /* Select P0.6. */
#define IN0SL__P0_7        0x07 /* Select P0.7. */

#define IN0PL__BMASK       0x08 /* INT0 Polarity */
#define IN0PL__SHIFT       0x03 /* INT0 Polarity */
#define IN0PL__ACTIVE_LOW  0x00 /* INT0 input is active low. */
#define IN0PL__ACTIVE_HIGH 0x08 /* INT0 input is active high. */

#define IN1SL__FMASK       0x70 /* INT1 Port Pin Selection */
#define IN1SL__SHIFT       0x04 /* INT1 Port Pin Selection */
#define IN1SL__P0_0        0x00 /* Select P0.0. */
#define IN1SL__P0_1        0x10 /* Select P0.1. */
#define IN1SL__P0_2        0x20 /* Select P0.2. */
#define IN1SL__P0_3        0x30 /* Select P0.3. */
#define IN1SL__P0_4        0x40 /* Select P0.4. */
#define IN1SL__P0_5        0x50 /* Select P0.5. */
#define IN1SL__P0_6        0x60 /* Select P0.6. */
#define IN1SL__P0_7        0x70 /* Select P0.7. */

#define IN1PL__BMASK       0x80 /* INT1 Polarity */
#define IN1PL__SHIFT       0x07 /* INT1 Polarity */
#define IN1PL__ACTIVE_LOW  0x00 /* INT1 input is active low. */
#define IN1PL__ACTIVE_HIGH 0x80 /* INT1 input is active high. */

/*------------------------------------------------------------------------------ */
/* FLKEY Enums (Flash Lock and Key @ 0xB7)                                       */
/*------------------------------------------------------------------------------ */
#define FLKEY__FMASK    0xFF /* Flash Lock and Key */
#define FLKEY__SHIFT    0x00 /* Flash Lock and Key */
#define FLKEY__LOCKED   0x00 /* Flash is write/erase locked. */
#define FLKEY__FIRST    0x01 /* The first key code has been written (0xA5). */
#define FLKEY__UNLOCKED 0x02 /* Flash is unlocked (writes/erases allowed). */
#define FLKEY__DISABLED 0x03 /* Flash writes/erases are disabled until the next reset. */
#define FLKEY__KEY1     0xA5 /* Flash writes and erases are enabled by writing 0xA5 followed by 0xF1 to the FLKEY register. */
#define FLKEY__KEY2     0xF1 /* Flash writes and erases are enabled by writing 0xA5 followed by 0xF1 to the FLKEY register. */

/*------------------------------------------------------------------------------ */
/* PSCTL Enums (Program Store Control @ 0x8F)                                    */
/*------------------------------------------------------------------------------ */
#define PSWE__BMASK          0x01 /* Program Store Write Enable */
#define PSWE__SHIFT          0x00 /* Program Store Write Enable */
#define PSWE__WRITE_DISABLED 0x00 /* Writes to flash program memory disabled. */
#define PSWE__WRITE_ENABLED  0x01 /* Writes to flash program memory enabled; the MOVX write instruction targets flash memory. */

#define PSEE__BMASK          0x02 /* Program Store Erase Enable */
#define PSEE__SHIFT          0x01 /* Program Store Erase Enable */
#define PSEE__ERASE_DISABLED 0x00 /* Flash program memory erasure disabled. */
#define PSEE__ERASE_ENABLED  0x02 /* Flash program memory erasure enabled. */

/*------------------------------------------------------------------------------ */
/* IP Enums (Interrupt Priority @ 0xB8)                                          */
/*------------------------------------------------------------------------------ */
#define PX0__BMASK   0x01 /* External Interrupt 0 Priority Control */
#define PX0__SHIFT   0x00 /* External Interrupt 0 Priority Control */
#define PX0__LOW     0x00 /* External Interrupt 0 set to low priority level. */
#define PX0__HIGH    0x01 /* External Interrupt 0 set to high priority level. */

#define PT0__BMASK   0x02 /* Timer 0 Interrupt Priority Control */
#define PT0__SHIFT   0x01 /* Timer 0 Interrupt Priority Control */
#define PT0__LOW     0x00 /* Timer 0 interrupt set to low priority level. */
#define PT0__HIGH    0x02 /* Timer 0 interrupt set to high priority level. */

#define PX1__BMASK   0x04 /* External Interrupt 1 Priority Control */
#define PX1__SHIFT   0x02 /* External Interrupt 1 Priority Control */
#define PX1__LOW     0x00 /* External Interrupt 1 set to low priority level. */
#define PX1__HIGH    0x04 /* External Interrupt 1 set to high priority level. */

#define PT1__BMASK   0x08 /* Timer 1 Interrupt Priority Control */
#define PT1__SHIFT   0x03 /* Timer 1 Interrupt Priority Control */
#define PT1__LOW     0x00 /* Timer 1 interrupt set to low priority level. */
#define PT1__HIGH    0x08 /* Timer 1 interrupt set to high priority level. */

