OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define PS0__BMASK   0x10 /* UART0 Interrupt Priority Control */
#define PS0__SHIFT   0x04 /* UART0 Interrupt Priority Control */
#define PS0__LOW     0x00 /* UART0 interrupt set to low priority level. */
#define PS0__HIGH    0x10 /* UART0 interrupt set to high priority level. */

#define PT2__BMASK   0x20 /* Timer 2 Interrupt Priority Control */
#define PT2__SHIFT   0x05 /* Timer 2 Interrupt Priority Control */
#define PT2__LOW     0x00 /* Timer 2 interrupt set to low priority level. */
#define PT2__HIGH    0x20 /* Timer 2 interrupt set to high priority level. */

#define PSPI0__BMASK 0x40 /* Serial Peripheral Interface (SPI0) Interrupt Priority Control */
#define PSPI0__SHIFT 0x06 /* Serial Peripheral Interface (SPI0) Interrupt Priority Control */
#define PSPI0__LOW   0x00 /* SPI0 interrupt set to low priority level. */
#define PSPI0__HIGH  0x40 /* SPI0 interrupt set to high priority level. */

/*------------------------------------------------------------------------------ */
/* LFO0CN Enums (Low Frequency Oscillator Control @ 0xB1)                        */
/*------------------------------------------------------------------------------ */
typedef union {
    uint8_t reg;
    struct {
        uint8_t OSCLD : 2;
        uint8_t OSCLF : 4;
        uint8_t OSCLRDY : 1;
        uint8_t OSCLEN : 1;
    } bf;
} LFO0CN_t;

#define OSCLD__DIVIDE_BY_8 0x00 /* Divide by 8 selected. */
#define OSCLD__DIVIDE_BY_4 0x01 /* Divide by 4 selected. */
#define OSCLD__DIVIDE_BY_2 0x02 /* Divide by 2 selected. */
#define OSCLD__DIVIDE_BY_1 0x03 /* Divide by 1 selected. */

#define OSCLRDY__NOT_SET   0x00 /* Internal L-F Oscillator frequency not stabilized. */
#define OSCLRDY__SET       0x01 /* Internal L-F Oscillator frequency stabilized. */

#define OSCLEN__DISABLED   0x00 /* Internal L-F Oscillator Disabled. */
#define OSCLEN__ENABLED    0x01 /* Internal L-F Oscillator Enabled. */

/*------------------------------------------------------------------------------ */
/* PRTDRV Enums (Port Drive Strength @ 0xF6)                                     */
/*------------------------------------------------------------------------------ */
#define P0DRV__BMASK      0x01 /* Port 0 Drive Strength */
#define P0DRV__SHIFT      0x00 /* Port 0 Drive Strength */
#define P0DRV__LOW_DRIVE  0x00 /* All pins on P0 use low drive strength. */
#define P0DRV__HIGH_DRIVE 0x01 /* All pins on P0 use high drive strength. */

#define P1DRV__BMASK      0x02 /* Port 1 Drive Strength */
#define P1DRV__SHIFT      0x01 /* Port 1 Drive Strength */
#define P1DRV__LOW_DRIVE  0x00 /* All pins on P1 use low drive strength. */
#define P1DRV__HIGH_DRIVE 0x02 /* All pins on P1 use high drive strength. */

#define P2DRV__BMASK      0x04 /* Port 2 Drive Strength */
#define P2DRV__SHIFT      0x02 /* Port 2 Drive Strength */
#define P2DRV__LOW_DRIVE  0x00 /* All pins on P2 use low drive strength. */
#define P2DRV__HIGH_DRIVE 0x04 /* All pins on P2 use high drive strength. */

/*------------------------------------------------------------------------------ */
/* PCON0 Enums (Power Control @ 0x87)                                            */
/*------------------------------------------------------------------------------ */
#define IDLE__BMASK  0x01 /* Idle Mode Select */
#define IDLE__SHIFT  0x00 /* Idle Mode Select */
#define IDLE__NORMAL 0x00 /* Idle mode not activated. */
#define IDLE__IDLE   0x01 /* CPU goes into Idle mode (shuts off clock to CPU, but clocks to enabled peripherals are still active). */

#define STOP__BMASK  0x02 /* Stop Mode Select */
#define STOP__SHIFT  0x01 /* Stop Mode Select */
#define STOP__NORMAL 0x00 /* Stop mode not activated. */
#define STOP__STOP   0x02 /* CPU goes into Stop mode (internal oscillator stopped). */

#define GF0__BMASK   0x04 /* General Purpose Flag 0 */
#define GF0__SHIFT   0x02 /* General Purpose Flag 0 */
#define GF0__NOT_SET 0x00 /* The GF0 flag is not set. Clear the GF0 flag. */
#define GF0__SET     0x04 /* The GF0 flag is set. Set the GF0 flag. */

#define GF1__BMASK   0x08 /* General Purpose Flag 1 */
#define GF1__SHIFT   0x03 /* General Purpose Flag 1 */
#define GF1__NOT_SET 0x00 /* The GF1 flag is not set. Clear the GF1 flag. */
#define GF1__SET     0x08 /* The GF1 flag is set. Set the GF1 flag. */

#define GF2__BMASK   0x10 /* General Purpose Flag 2 */
#define GF2__SHIFT   0x04 /* General Purpose Flag 2 */
#define GF2__NOT_SET 0x00 /* The GF2 flag is not set. Clear the GF2 flag. */
#define GF2__SET     0x10 /* The GF2 flag is set. Set the GF2 flag. */

#define GF3__BMASK   0x20 /* General Purpose Flag 3 */
#define GF3__SHIFT   0x05 /* General Purpose Flag 3 */
#define GF3__NOT_SET 0x00 /* The GF3 flag is not set. Clear the GF3 flag. */
#define GF3__SET     0x20 /* The GF3 flag is set. Set the GF3 flag. */

#define GF4__BMASK   0x40 /* General Purpose Flag 4 */
#define GF4__SHIFT   0x06 /* General Purpose Flag 4 */
#define GF4__NOT_SET 0x00 /* The GF4 flag is not set. Clear the GF4 flag. */
#define GF4__SET     0x40 /* The GF4 flag is set. Set the GF4 flag. */

#define GF5__BMASK   0x80 /* General Purpose Flag 5 */
#define GF5__SHIFT   0x07 /* General Purpose Flag 5 */
#define GF5__NOT_SET 0x00 /* The GF5 flag is not set. Clear the GF5 flag. */
#define GF5__SET     0x80 /* The GF5 flag is set. Set the GF5 flag. */

/*------------------------------------------------------------------------------ */
/* RSTSRC Enums (Reset Source @ 0xEF)                                            */
/*------------------------------------------------------------------------------ */
#define PINRSF__BMASK   0x01 /* HW Pin Reset Flag */
#define PINRSF__SHIFT   0x00 /* HW Pin Reset Flag */
#define PINRSF__NOT_SET 0x00 /* The RSTb pin did not cause the last reset. */
#define PINRSF__SET     0x01 /* The RSTb pin caused the last reset. */

#define PORSF__BMASK    0x02 /* Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable */
#define PORSF__SHIFT    0x01 /* Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable */
#define PORSF__NOT_SET  0x00 /* A power-on or supply monitor reset did not occur. */
#define PORSF__SET      0x02 /* A power-on or supply monitor reset occurred. */

#define MCDRSF__BMASK   0x04 /* Missing Clock Detector Enable and Flag */
#define MCDRSF__SHIFT   0x02 /* Missing Clock Detector Enable and Flag */
#define MCDRSF__NOT_SET 0x00 /* A missing clock detector reset did not occur. */
#define MCDRSF__SET     0x04 /* A missing clock detector reset occurred. */

