OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define WDTRSF__BMASK   0x08 /* Watchdog Timer Reset Flag */
#define WDTRSF__SHIFT   0x03 /* Watchdog Timer Reset Flag */
#define WDTRSF__NOT_SET 0x00 /* A watchdog timer overflow reset did not occur. */
#define WDTRSF__SET     0x08 /* A watchdog timer overflow reset occurred. */

#define SWRSF__BMASK    0x10 /* Software Reset Force and Flag */
#define SWRSF__SHIFT    0x04 /* Software Reset Force and Flag */
#define SWRSF__NOT_SET  0x00 /* A software reset did not occur. */
#define SWRSF__SET      0x10 /* A software reset occurred. */

#define C0RSEF__BMASK   0x20 /* Comparator0 Reset Enable and Flag */
#define C0RSEF__SHIFT   0x05 /* Comparator0 Reset Enable and Flag */
#define C0RSEF__NOT_SET 0x00 /* A Comparator 0 reset did not occur. */
#define C0RSEF__SET     0x20 /* A Comparator 0 reset occurred. */

#define FERROR__BMASK   0x40 /* Flash Error Reset Flag */
#define FERROR__SHIFT   0x06 /* Flash Error Reset Flag */
#define FERROR__NOT_SET 0x00 /* A flash error reset did not occur. */
#define FERROR__SET     0x40 /* A flash error reset occurred. */

/*------------------------------------------------------------------------------ */
/* CKCON0 Enums (Clock Control 0 @ 0x8E)                                         */
/*------------------------------------------------------------------------------ */
#define SCA__FMASK           0x03 /* Timer 0/1 Prescale */
#define SCA__SHIFT           0x00 /* Timer 0/1 Prescale */
#define SCA__SYSCLK_DIV_12   0x00 /* System clock divided by 12. */
#define SCA__SYSCLK_DIV_4    0x01 /* System clock divided by 4. */
#define SCA__SYSCLK_DIV_48   0x02 /* System clock divided by 48. */
#define SCA__EXTOSC_DIV_8    0x03 /* External oscillator divided by 8 (synchronized with the system clock). */

#define T0M__PRESCALE        0x00 /* Counter/Timer 0 uses the clock defined by the prescale field, SCA. */
#define T0M__SYSCLK          0x04 /* Counter/Timer 0 uses the system clock. */

#define T1M__PRESCALE        0x00 /* Timer 1 uses the clock defined by the prescale field, SCA. */
#define T1M__SYSCLK          0x08 /* Timer 1 uses the system clock. */

#define T2ML__BMASK          0x10 /* Timer 2 Low Byte Clock Select */
#define T2ML__SHIFT          0x04 /* Timer 2 Low Byte Clock Select */
#define T2ML__EXTERNAL_CLOCK 0x00 /* Timer 2 low byte uses the clock defined by T2XCLK in TMR2CN0. */
#define T2ML__SYSCLK         0x10 /* Timer 2 low byte uses the system clock. */

#define T2MH__BMASK          0x20 /* Timer 2 High Byte Clock Select */
#define T2MH__SHIFT          0x05 /* Timer 2 High Byte Clock Select */
#define T2MH__EXTERNAL_CLOCK 0x00 /* Timer 2 high byte uses the clock defined by T2XCLK in TMR2CN0. */
#define T2MH__SYSCLK         0x20 /* Timer 2 high byte uses the system clock. */

#define T3ML__BMASK          0x40 /* Timer 3 Low Byte Clock Select */
#define T3ML__SHIFT          0x06 /* Timer 3 Low Byte Clock Select */
#define T3ML__EXTERNAL_CLOCK 0x00 /* Timer 3 low byte uses the clock defined by T3XCLK in TMR3CN0. */
#define T3ML__SYSCLK         0x40 /* Timer 3 low byte uses the system clock. */

#define T3MH__BMASK          0x80 /* Timer 3 High Byte Clock Select */
#define T3MH__SHIFT          0x07 /* Timer 3 High Byte Clock Select */
#define T3MH__EXTERNAL_CLOCK 0x00 /* Timer 3 high byte uses the clock defined by T3XCLK in TMR3CN0. */
#define T3MH__SYSCLK         0x80 /* Timer 3 high byte uses the system clock. */

/*------------------------------------------------------------------------------ */
/* TCON Enums (Timer 0/1 Control @ 0x88)                                         */
/*------------------------------------------------------------------------------ */
#define IT0__BMASK   0x01 /* Interrupt 0 Type Select */
#define IT0__SHIFT   0x00 /* Interrupt 0 Type Select */
#define IT0__LEVEL   0x00 /* INT0 is level triggered. */
#define IT0__EDGE    0x01 /* INT0 is edge triggered. */

#define IE0__BMASK   0x02 /* External Interrupt 0 */
#define IE0__SHIFT   0x01 /* External Interrupt 0 */
#define IE0__NOT_SET 0x00 /* Edge/level not detected. */
#define IE0__SET     0x02 /* Edge/level detected */

#define IT1__BMASK   0x04 /* Interrupt 1 Type Select */
#define IT1__SHIFT   0x02 /* Interrupt 1 Type Select */
#define IT1__LEVEL   0x00 /* INT1 is level triggered. */
#define IT1__EDGE    0x04 /* INT1 is edge triggered. */

#define IE1__BMASK   0x08 /* External Interrupt 1 */
#define IE1__SHIFT   0x03 /* External Interrupt 1 */
#define IE1__NOT_SET 0x00 /* Edge/level not detected. */
#define IE1__SET     0x08 /* Edge/level detected */

#define TR0__BMASK   0x10 /* Timer 0 Run Control */
#define TR0__SHIFT   0x04 /* Timer 0 Run Control */
#define TR0__STOP    0x00 /* Stop Timer 0. */
#define TR0__RUN     0x10 /* Start Timer 0 running. */

#define TF0__BMASK   0x20 /* Timer 0 Overflow Flag */
#define TF0__SHIFT   0x05 /* Timer 0 Overflow Flag */
#define TF0__NOT_SET 0x00 /* Timer 0 did not overflow. */
#define TF0__SET     0x20 /* Timer 0 overflowed. */

#define TR1__BMASK   0x40 /* Timer 1 Run Control */
#define TR1__SHIFT   0x06 /* Timer 1 Run Control */
#define TR1__STOP    0x00 /* Stop Timer 1. */
#define TR1__RUN     0x40 /* Start Timer 1 running. */

#define TF1__BMASK   0x80 /* Timer 1 Overflow Flag */
#define TF1__SHIFT   0x07 /* Timer 1 Overflow Flag */
#define TF1__NOT_SET 0x00 /* Timer 1 did not overflow. */
#define TF1__SET     0x80 /* Timer 1 overflowed. */

/*------------------------------------------------------------------------------ */
/* TMOD Enums (Timer 0/1 Mode @ 0x89)                                            */
/*------------------------------------------------------------------------------ */
#define T0M__MODE0      0x00 /* Mode 0, 13-bit Counter/Timer */
#define T0M__MODE1      0x01 /* Mode 1, 16-bit Counter/Timer */
#define T0M__MODE2      0x02 /* Mode 2, 8-bit Counter/Timer with Auto-Reload */
#define T0M__MODE3      0x03 /* Mode 3, Two 8-bit Counter/Timers */

#define CT0__BMASK      0x04 /* Counter/Timer 0 Select */
#define CT0__SHIFT      0x02 /* Counter/Timer 0 Select */
#define CT0__TIMER      0x00 /* Timer Mode. Timer 0 increments on the clock defined by T0M in the CKCON0 register. */
#define CT0__COUNTER    0x04 /* Counter Mode. Timer 0 increments on high-to-low transitions of an external pin (T0). */

#define GATE0__BMASK    0x08 /* Timer 0 Gate Control */
#define GATE0__SHIFT    0x03 /* Timer 0 Gate Control */
#define GATE0__DISABLED 0x00 /* Timer 0 enabled when TR0 = 1 irrespective of INT0 logic level. */
#define GATE0__ENABLED  0x08 /* Timer 0 enabled only when TR0 = 1 and INT0 is active as defined by bit IN0PL in register IT01CF. */

#define T1M__FMASK      0x30 /* Timer 1 Mode Select */
#define T1M__SHIFT      0x04 /* Timer 1 Mode Select */
#define T1M__MODE0      0x00 /* Mode 0, 13-bit Counter/Timer */
#define T1M__MODE1      0x10 /* Mode 1, 16-bit Counter/Timer */
#define T1M__MODE2      0x20 /* Mode 2, 8-bit Counter/Timer with Auto-Reload */
#define T1M__MODE3      0x30 /* Mode 3, Timer 1 Inactive */

