OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/EFM8BB1.h
#define CT1__BMASK      0x40 /* Counter/Timer 1 Select */
#define CT1__SHIFT      0x06 /* Counter/Timer 1 Select */
#define CT1__TIMER      0x00 /* Timer Mode. Timer 1 increments on the clock defined by T1M in the CKCON0 register. */
#define CT1__COUNTER    0x40 /* Counter Mode. Timer 1 increments on high-to-low transitions of an external pin (T1). */

#define GATE1__BMASK    0x80 /* Timer 1 Gate Control */
#define GATE1__SHIFT    0x07 /* Timer 1 Gate Control */
#define GATE1__DISABLED 0x00 /* Timer 1 enabled when TR1 = 1 irrespective of INT1 logic level. */
#define GATE1__ENABLED  0x80 /* Timer 1 enabled only when TR1 = 1 and INT1 is active as defined by bit IN1PL in register IT01CF. */

/*------------------------------------------------------------------------------ */
/* VDM0CN Enums (Supply Monitor Control @ 0xFF)                                  */
/*------------------------------------------------------------------------------ */
#define VDDSTAT__BMASK  0x40 /* Supply Status */
#define VDDSTAT__SHIFT  0x06 /* Supply Status */
#define VDDSTAT__BELOW  0x00 /* VDD is at or below the supply monitor threshold. */
#define VDDSTAT__ABOVE  0x40 /* VDD is above the supply monitor threshold. */

#define VDMEN__BMASK    0x80 /* Supply Monitor Enable */
#define VDMEN__SHIFT    0x07 /* Supply Monitor Enable */
#define VDMEN__DISABLED 0x00 /* Supply Monitor Disabled. */
#define VDMEN__ENABLED  0x80 /* Supply Monitor Enabled. */

/*------------------------------------------------------------------------------ */
/* Watchdog Timer Control                                                        */
/*------------------------------------------------------------------------------ */

#ifdef WDT_no

#define WDT_lockout() 
#define WDT_reset()   
#define WDT_enable()  
#define WDT_1ms()     
#define WDT_2ms()     
#define WDT_13ms()    
#define WDT_51ms()    
#define WDT_204ms()   
#define WDT_819ms()   
#define WDT_32767ms() 
#define WDT_13107ms() 

#else

#define WDT_lockout() WDTCN=0xff
#define WDT_reset()   WDTCN=0xA5
#define WDT_enable()  WDTCN=0xA5
#define WDT_1ms()     WDTCN=0x00
#define WDT_2ms()     WDTCN=0x01
#define WDT_13ms()    WDTCN=0x02
#define WDT_51ms()    WDTCN=0x03
#define WDT_204ms()   WDTCN=0x04
#define WDT_819ms()   WDTCN=0x05
#define WDT_32767ms() WDTCN=0x06
#define WDT_13107ms() WDTCN=0x07

#endif /* WDT_no */

#endif /* EFM8BB1_H */
